[NoCoverage] MethodCallRemoval
Command/MakeAdminCommand.php:17:9
 {
     public function __construct(private RoleService $roleService)
     {
-        parent::__construct();
+        
     }
 

[NoCoverage] MethodCallRemoval
Command/MakeAdminCommand.php:22:9
 
     protected function configure(): void
     {
-        $this->addArgument('user-id', InputArgument::REQUIRED, 'User id');
+        
     }
 

[NoCoverage] CastInt
Command/MakeAdminCommand.php:27:9
 
     protected function execute(InputInterface $input, OutputInterface $output): int
     {
-        $this->roleService->grantAdmin((int) $input->getArgument('user-id'));
+        $this->roleService->grantAdmin($input->getArgument('user-id'));
 
         return Command::SUCCESS;

[NoCoverage] MethodCallRemoval
Command/MakeAdminCommand.php:27:9
 
     protected function execute(InputInterface $input, OutputInterface $output): int
     {
-        $this->roleService->grantAdmin((int) $input->getArgument('user-id'));
+        
 
         return Command::SUCCESS;
