[Killed] PublicVisibility
Controller/AuthController.php:21:5
     {
     }
 
-    #[OA\Response(response: 200, description: 'Signs up a user',
+    protected function signUp(#[MapRequestPayload] SignUpRequest $signUpRequest) : Response
         content: new OA\JsonContent(properties: [
             new OA\Property(property: 'token', type: 'string'),
killedBy: App\Tests\Controller\AuthControllerTest::testSignUp
statusReason: 1) App\Tests\Controller\AuthControllerTest::testSignUp
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:04 GMT
X-Robots-Tag:  noindex

[NoCoverage] ArrayItemRemoval
Controller/AuthController.php:22:9
     }
 
     #[OA\Response(response: 200, description: 'Signs up a user',
-        content: new OA\JsonContent(properties: [
-            new OA\Property(property: 'token', type: 'string'),
-            new OA\Property(property: 'refresh_token', type: 'string')])
+        #[OA\Response(response: 200, description: 'Signs up a user', content: new OA\JsonContent(properties: [new OA\Property(property: 'refresh_token', type: 'string')]))]ken', type: 'string')])
     )]
     #[OA\RequestBody(content: new Model(type: SignUpRequest::class))]

[NoCoverage] IncrementInteger
Controller/AuthController.php:27:5
             new OA\Property(property: 'refresh_token', type: 'string')])
     )]
     #[OA\RequestBody(content: new Model(type: SignUpRequest::class))]
-    #[OA\Response(response: 409, description: 'User already exist', content: new Model(type: ErrorResponse::class))]
+    #[OA\Response(response: 410, description: 'User already exist', content: new Model(type: ErrorResponse::class))]
     #[OA\Response(response: 422, description: 'Validation errors', content: new Model(type: ErrorResponse::class))]
     #[Route(path: '/api/v1/auth/signup', name: 'signup', methods: 'POST')]

[NoCoverage] DecrementInteger
Controller/AuthController.php:27:5
             new OA\Property(property: 'refresh_token', type: 'string')])
     )]
     #[OA\RequestBody(content: new Model(type: SignUpRequest::class))]
-    #[OA\Response(response: 409, description: 'User already exist', content: new Model(type: ErrorResponse::class))]
+    #[OA\Response(response: 408, description: 'User already exist', content: new Model(type: ErrorResponse::class))]
     #[OA\Response(response: 422, description: 'Validation errors', content: new Model(type: ErrorResponse::class))]
     #[Route(path: '/api/v1/auth/signup', name: 'signup', methods: 'POST')]

[NoCoverage] DecrementInteger
Controller/AuthController.php:28:5
     )]
     #[OA\RequestBody(content: new Model(type: SignUpRequest::class))]
     #[OA\Response(response: 409, description: 'User already exist', content: new Model(type: ErrorResponse::class))]
-    #[OA\Response(response: 422, description: 'Validation errors', content: new Model(type: ErrorResponse::class))]
+    #[OA\Response(response: 421, description: 'Validation errors', content: new Model(type: ErrorResponse::class))]
     #[Route(path: '/api/v1/auth/signup', name: 'signup', methods: 'POST')]
     public function signUp(#[MapRequestPayload] SignUpRequest $signUpRequest): Response

[NoCoverage] IncrementInteger
Controller/AuthController.php:28:5
     )]
     #[OA\RequestBody(content: new Model(type: SignUpRequest::class))]
     #[OA\Response(response: 409, description: 'User already exist', content: new Model(type: ErrorResponse::class))]
-    #[OA\Response(response: 422, description: 'Validation errors', content: new Model(type: ErrorResponse::class))]
+    #[OA\Response(response: 423, description: 'Validation errors', content: new Model(type: ErrorResponse::class))]
     #[Route(path: '/api/v1/auth/signup', name: 'signup', methods: 'POST')]
     public function signUp(#[MapRequestPayload] SignUpRequest $signUpRequest): Response
