[NoCoverage] PublicVisibility
Entity/RefreshToken.php:85:5
         return $this;
     }
 
-    public function getUser(): UserInterface
+    protected function getUser() : UserInterface
     {
         return $this->user;

[Survived] PublicVisibility
Entity/RefreshToken.php:90:5
         return $this->user;
     }
 
-    public function setUser(UserInterface $user): static
+    protected function setUser(UserInterface $user) : static
     {
         $this->user = $user;

[NoCoverage] PublicVisibility
Entity/RefreshToken.php:97:5
         return $this;
     }
 
-    public function getCreatedAt(): DateTimeImmutable
+    protected function getCreatedAt() : DateTimeImmutable
     {
         return $this->createdAt;

[NoCoverage] PublicVisibility
Entity/RefreshToken.php:102:5
         return $this->createdAt;
     }
 
-    public function setCreatedAt(DateTimeImmutable $createdAt): static
+    protected function setCreatedAt(DateTimeImmutable $createdAt) : static
     {
         $this->createdAt = $createdAt;

[Killed] MethodCallRemoval
Entity/RefreshToken.php:113:9
     {
         /** @var RefreshToken $model */
         $model = parent::createForUserWithTtl($refreshToken, $user, $ttl);
-        $model->setUser($user);
+        
 
         return $model;
killedBy: App\Tests\Controller\AdminControllerTest::testGrantAuthor
statusReason: 1) App\Tests\Controller\AdminControllerTest::testGrantAuthor
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:33 GMT
X-Robots-Tag:  noindex
