[Killed] PublicVisibility
Controller/AdminController.php:19:5
     {
     }
 
-    #[OA\Response(response: 200, description: 'Grants ROLE_AUTHOR to a user')]
+    protected function grantAuthor(int $userId) : Response
     #[OA\Response(response: 404, description: 'User not found', attachables: [new Model(type: ErrorResponse::class)])]
     #[Route(path: '/api/v1/admin/grand-author/{userId}', methods: 'POST')]
killedBy: App\Tests\Controller\AdminControllerTest::testGrantAuthor
statusReason: 1) App\Tests\Controller\AdminControllerTest::testGrantAuthor
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:04 GMT
X-Robots-Tag:  noindex

[NoCoverage] DecrementInteger
Controller/AdminController.php:19:5
     {
     }
 
-    #[OA\Response(response: 200, description: 'Grants ROLE_AUTHOR to a user')]
+    #[OA\Response(response: 199, description: 'Grants ROLE_AUTHOR to a user')]
     #[OA\Response(response: 404, description: 'User not found', attachables: [new Model(type: ErrorResponse::class)])]
     #[Route(path: '/api/v1/admin/grand-author/{userId}', methods: 'POST')]

[NoCoverage] IncrementInteger
Controller/AdminController.php:20:5
     }
 
     #[OA\Response(response: 200, description: 'Grants ROLE_AUTHOR to a user')]
-    #[OA\Response(response: 404, description: 'User not found', attachables: [new Model(type: ErrorResponse::class)])]
+    #[OA\Response(response: 405, description: 'User not found', attachables: [new Model(type: ErrorResponse::class)])]
     #[Route(path: '/api/v1/admin/grand-author/{userId}', methods: 'POST')]
     public function grantAuthor(int $userId): Response

[NoCoverage] DecrementInteger
Controller/AdminController.php:20:5
     }
 
     #[OA\Response(response: 200, description: 'Grants ROLE_AUTHOR to a user')]
-    #[OA\Response(response: 404, description: 'User not found', attachables: [new Model(type: ErrorResponse::class)])]
+    #[OA\Response(response: 403, description: 'User not found', attachables: [new Model(type: ErrorResponse::class)])]
     #[Route(path: '/api/v1/admin/grand-author/{userId}', methods: 'POST')]
     public function grantAuthor(int $userId): Response

[Survived] MethodCallRemoval
Controller/AdminController.php:24:9
     #[Route(path: '/api/v1/admin/grand-author/{userId}', methods: 'POST')]
     public function grantAuthor(int $userId): Response
     {
-        $this->roleService->grantAuthor($userId);
+        
 
         return new Response('', 201);

[Survived] IncrementInteger
Controller/AdminController.php:26:9
     {
         $this->roleService->grantAuthor($userId);
 
-        return new Response('', 201);
+        return new Response('', 202);
     }
 }

[Survived] DecrementInteger
Controller/AdminController.php:26:9
     {
         $this->roleService->grantAuthor($userId);
 
-        return new Response('', 201);
+        return new Response('', 200);
     }
 }
