[NoCoverage] Identical
Security/JWTUserProvider.php:32:9
 
     public function supportsClass(string $class): bool
     {
-        return User::class === $class || is_subclass_of($class, User::class);
+        return User::class !== $class || is_subclass_of($class, User::class);
     }
 

[NoCoverage] LogicalOrAllSubExprNegation
Security/JWTUserProvider.php:32:9
 
     public function supportsClass(string $class): bool
     {
-        return User::class === $class || is_subclass_of($class, User::class);
+        return !(User::class === $class) || !is_subclass_of($class, User::class);
     }
 

[Killed] PublicVisibility
Security/JWTUserProvider.php:43:5
     /**
      * @param string[] $payload
      */
-    public function loadUserByIdentifierAndPayload(string $identifier, array $payload): UserInterface
+    protected function loadUserByIdentifierAndPayload(string $identifier, array $payload) : UserInterface
     {
         return $this->getUser('id', $payload['id']);
killedBy: App\Tests\Controller\AdminControllerTest::testGrantAuthor
statusReason: 1) App\Tests\Controller\AdminControllerTest::testGrantAuthor
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:47 GMT
X-Robots-Tag:  noindex

[Killed] ArrayItemRemoval
Security/JWTUserProvider.php:50:9
 
     private function getUser(string $key, string|int $value): UserInterface
     {
-        $user = $this->userRepository->findOneBy([$key => $value]);
+        $user = $this->userRepository->findOneBy([]);
 
         if (null === $user) {
killedBy: App\Tests\Controller\AdminControllerTest::testGrantAuthor
statusReason: 1) App\Tests\Controller\AdminControllerTest::testGrantAuthor
Failed asserting that the Response is successful.
HTTP/1.1 401 Unauthorized
Cache-Control:    no-cache, private
Content-Type:     application/json
Date:             Tue, 05 Dec 2023 17:03:48 GMT
Www-Authenticate: Bearer
X-Robots-Tag:     noindex

[Killed] Identical
Security/JWTUserProvider.php:52:9
     {
         $user = $this->userRepository->findOneBy([$key => $value]);
 
-        if (null === $user) {
+        if (null !== $user) {
             $e = new UserNotFoundException('User with id not found');
             $e->setUserIdentifier($value);
killedBy: App\Tests\Controller\AdminControllerTest::testGrantAuthor
statusReason: 1) App\Tests\Controller\AdminControllerTest::testGrantAuthor
Failed asserting that the Response is successful.
HTTP/1.1 401 Unauthorized
Cache-Control:    no-cache, private
Content-Type:     application/json
Date:             Tue, 05 Dec 2023 17:03:48 GMT
Www-Authenticate: Bearer
X-Robots-Tag:     noindex

[NoCoverage] MethodCallRemoval
Security/JWTUserProvider.php:54:13
 
         if (null === $user) {
             $e = new UserNotFoundException('User with id not found');
-            $e->setUserIdentifier($value);
+            
 
             throw $e;
