[Killed] PublicVisibility
Controller/BookCategoryController.php:20:5
     ) {
     }
 
-    #[OA\Response(response: 200, description: 'Return book categories', content: new Model(type: BookCategoryListResponse::class))]
+    protected function index() : Response
     #[Route(path: '/api/v1/categories', name: 'categories', methods: 'GET|OPTIONS')]
     public function index(): Response
killedBy: App\Tests\Controller\BookCategoryControllerTest::testIndex
statusReason: 1) App\Tests\Controller\BookCategoryControllerTest::testIndex
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:05 GMT
X-Robots-Tag:  noindex

[NoCoverage] IncrementInteger
Controller/BookCategoryController.php:20:5
     ) {
     }
 
-    #[OA\Response(response: 200, description: 'Return book categories', content: new Model(type: BookCategoryListResponse::class))]
+    #[OA\Response(response: 201, description: 'Return book categories', content: new Model(type: BookCategoryListResponse::class))]
     #[Route(path: '/api/v1/categories', name: 'categories', methods: 'GET|OPTIONS')]
     public function index(): Response
