9) /app/src/Entity/RefreshToken.php:90    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->user;
     }
-    public function setUser(UserInterface $user) : static
+    protected function setUser(UserInterface $user) : static
     {
         $this->user = $user;
         return $this;

9) /app/src/Controller/AuthController.php:21    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function __construct(private readonly SignUpService $signUpService)
     {
     }
-    #[OA\Response(response: 200, description: 'Signs up a user', content: new OA\JsonContent(properties: [new OA\Property(property: 'token', type: 'string'), new OA\Property(property: 'refresh_token', type: 'string')]))]
+    #[OA\Response(response: 199, description: 'Signs up a user', content: new OA\JsonContent(properties: [new OA\Property(property: 'token', type: 'string'), new OA\Property(property: 'refresh_token', type: 'string')]))]
     #[OA\RequestBody(content: new Model(type: SignUpRequest::class))]
     #[OA\Response(response: 409, description: 'User already exist', content: new Model(type: ErrorResponse::class))]
     #[OA\Response(response: 422, description: 'Validation errors', content: new Model(type: ErrorResponse::class))]

10) /app/src/Controller/AuthController.php:21    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function __construct(private readonly SignUpService $signUpService)
     {
     }
-    #[OA\Response(response: 200, description: 'Signs up a user', content: new OA\JsonContent(properties: [new OA\Property(property: 'token', type: 'string'), new OA\Property(property: 'refresh_token', type: 'string')]))]
+    #[OA\Response(response: 201, description: 'Signs up a user', content: new OA\JsonContent(properties: [new OA\Property(property: 'token', type: 'string'), new OA\Property(property: 'refresh_token', type: 'string')]))]
     #[OA\RequestBody(content: new Model(type: SignUpRequest::class))]
     #[OA\Response(response: 409, description: 'User already exist', content: new Model(type: ErrorResponse::class))]
     #[OA\Response(response: 422, description: 'Validation errors', content: new Model(type: ErrorResponse::class))]

11) /app/src/Controller/AuthController.php:22    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function __construct(private readonly SignUpService $signUpService)
     {
     }
-    #[OA\Response(response: 200, description: 'Signs up a user', content: new OA\JsonContent(properties: [new OA\Property(property: 'token', type: 'string'), new OA\Property(property: 'refresh_token', type: 'string')]))]
+    #[OA\Response(response: 200, description: 'Signs up a user', content: new OA\JsonContent(properties: [new OA\Property(property: 'refresh_token', type: 'string')]))]
     #[OA\RequestBody(content: new Model(type: SignUpRequest::class))]
     #[OA\Response(response: 409, description: 'User already exist', content: new Model(type: ErrorResponse::class))]
     #[OA\Response(response: 422, description: 'Validation errors', content: new Model(type: ErrorResponse::class))]

64) /app/src/Entity/RefreshToken.php:85    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->valid = $valid;
         return $this;
     }
-    public function getUser() : UserInterface
+    protected function getUser() : UserInterface
     {
         return $this->user;
     }

66) /app/src/Entity/RefreshToken.php:102    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->createdAt;
     }
-    public function setCreatedAt(DateTimeImmutable $createdAt) : static
+    protected function setCreatedAt(DateTimeImmutable $createdAt) : static
     {
         $this->createdAt = $createdAt;
         return $this;

107) /app/src/Security/JWTUserProvider.php:32    [M] LogicalOr

--- Original
+++ New
@@ @@
     }
     public function supportsClass(string $class) : bool
     {
-        return User::class === $class || is_subclass_of($class, User::class);
+        return User::class === $class && is_subclass_of($class, User::class);
     }
     public function loadUserByIdentifier(string $identifier) : UserInterface
     {

109) /app/src/Security/JWTUserProvider.php:32    [M] LogicalOrNegation

--- Original
+++ New
@@ @@
     }
     public function supportsClass(string $class) : bool
     {
-        return User::class === $class || is_subclass_of($class, User::class);
+        return !(User::class === $class || is_subclass_of($class, User::class));
     }
     public function loadUserByIdentifier(string $identifier) : UserInterface
     {

110) /app/src/Security/JWTUserProvider.php:32    [M] LogicalOrSingleSubExprNegation

--- Original
+++ New
@@ @@
     }
     public function supportsClass(string $class) : bool
     {
-        return User::class === $class || is_subclass_of($class, User::class);
+        return User::class === $class || !is_subclass_of($class, User::class);
     }
     public function loadUserByIdentifier(string $identifier) : UserInterface
     {

112) /app/src/Security/JWTUserProvider.php:56    [M] Throw_

--- Original
+++ New
@@ @@
         if (null === $user) {
             $e = new UserNotFoundException('User with id not found');
             $e->setUserIdentifier($value);
-            throw $e;
+            $e;
         }
         return $user;
     }
 }
