[Killed] PublicVisibility
Controller/BookController.php:26:5
     ) {
     }
 
-    #[OA\Response(response: 200, description: 'Return book by category id', content: new Model(type: BookListResponse::class))]
+    protected function booksByCategory(int $id) : Response
     #[OA\Response(response: 404, description: 'Book category not found')]
     #[Route(path: '/api/v1/books/category/{id}', name: 'book_by_category', methods: 'GET|OPTIONS')]
killedBy: App\Tests\Controller\BookControllerTest::testBooksByCategory
statusReason: 1) App\Tests\Controller\BookControllerTest::testBooksByCategory
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:05 GMT
X-Robots-Tag:  noindex

[NoCoverage] DecrementInteger
Controller/BookController.php:26:5
     ) {
     }
 
-    #[OA\Response(response: 200, description: 'Return book by category id', content: new Model(type: BookListResponse::class))]
+    #[OA\Response(response: 199, description: 'Return book by category id', content: new Model(type: BookListResponse::class))]
     #[OA\Response(response: 404, description: 'Book category not found')]
     #[Route(path: '/api/v1/books/category/{id}', name: 'book_by_category', methods: 'GET|OPTIONS')]

[NoCoverage] DecrementInteger
Controller/BookController.php:27:5
     }
 
     #[OA\Response(response: 200, description: 'Return book by category id', content: new Model(type: BookListResponse::class))]
-    #[OA\Response(response: 404, description: 'Book category not found')]
+    #[OA\Response(response: 403, description: 'Book category not found')]
     #[Route(path: '/api/v1/books/category/{id}', name: 'book_by_category', methods: 'GET|OPTIONS')]
     public function booksByCategory(int $id): Response

[NoCoverage] IncrementInteger
Controller/BookController.php:27:5
     }
 
     #[OA\Response(response: 200, description: 'Return book by category id', content: new Model(type: BookListResponse::class))]
-    #[OA\Response(response: 404, description: 'Book category not found')]
+    #[OA\Response(response: 405, description: 'Book category not found')]
     #[Route(path: '/api/v1/books/category/{id}', name: 'book_by_category', methods: 'GET|OPTIONS')]
     public function booksByCategory(int $id): Response

[Killed] PublicVisibility
Controller/BookController.php:34:5
         return $this->json($this->bookCategoryService->findBooksByCategory($id));
     }
 
-    #[OA\Response(response: 200, description: 'Return book by recommendations id', content: new Model(type: BookListRecommendationResponse::class))]
+    protected function booksByRecommendations(int $id) : Response
     #[OA\Response(response: 403, description: 'Access Denied')]
     #[Route(path: '/api/v1/books/recommendation/{id}', name: 'book_by_recommendation', methods: 'GET|OPTIONS')]
killedBy: App\Tests\Controller\BookControllerTest::testBooksByRecommendations
statusReason: 1) App\Tests\Controller\BookControllerTest::testBooksByRecommendations
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:06 GMT
X-Robots-Tag:  noindex

[NoCoverage] DecrementInteger
Controller/BookController.php:34:5
         return $this->json($this->bookCategoryService->findBooksByCategory($id));
     }
 
-    #[OA\Response(response: 200, description: 'Return book by recommendations id', content: new Model(type: BookListRecommendationResponse::class))]
+    #[OA\Response(response: 199, description: 'Return book by recommendations id', content: new Model(type: BookListRecommendationResponse::class))]
     #[OA\Response(response: 403, description: 'Access Denied')]
     #[Route(path: '/api/v1/books/recommendation/{id}', name: 'book_by_recommendation', methods: 'GET|OPTIONS')]

[NoCoverage] IncrementInteger
Controller/BookController.php:35:5
     }
 
     #[OA\Response(response: 200, description: 'Return book by recommendations id', content: new Model(type: BookListRecommendationResponse::class))]
-    #[OA\Response(response: 403, description: 'Access Denied')]
+    #[OA\Response(response: 404, description: 'Access Denied')]
     #[Route(path: '/api/v1/books/recommendation/{id}', name: 'book_by_recommendation', methods: 'GET|OPTIONS')]
     public function booksByRecommendations(int $id): Response

[NoCoverage] DecrementInteger
Controller/BookController.php:35:5
     }
 
     #[OA\Response(response: 200, description: 'Return book by recommendations id', content: new Model(type: BookListRecommendationResponse::class))]
-    #[OA\Response(response: 403, description: 'Access Denied')]
+    #[OA\Response(response: 402, description: 'Access Denied')]
     #[Route(path: '/api/v1/books/recommendation/{id}', name: 'book_by_recommendation', methods: 'GET|OPTIONS')]
     public function booksByRecommendations(int $id): Response

[Killed] PublicVisibility
Controller/BookController.php:42:5
         return $this->json($this->bookCategoryService->findBooksByRecommendations($id));
     }
 
-    #[OA\Response(response: 200, description: 'Return book details information', content: new Model(type: BookDetails::class))]
+    protected function booksById(int $id) : Response
     #[OA\Response(response: 404, description: 'Book not found')]
     #[Route(path: '/api/v1/books/{id}', name: 'book_by_id', methods: 'GET|OPTIONS')]
killedBy: App\Tests\Controller\BookControllerTest::testBookById
statusReason: 1) App\Tests\Controller\BookControllerTest::testBookById
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:06 GMT
X-Robots-Tag:  noindex

[NoCoverage] IncrementInteger
Controller/BookController.php:42:5
         return $this->json($this->bookCategoryService->findBooksByRecommendations($id));
     }
 
-    #[OA\Response(response: 200, description: 'Return book details information', content: new Model(type: BookDetails::class))]
+    #[OA\Response(response: 201, description: 'Return book details information', content: new Model(type: BookDetails::class))]
     #[OA\Response(response: 404, description: 'Book not found')]
     #[Route(path: '/api/v1/books/{id}', name: 'book_by_id', methods: 'GET|OPTIONS')]

[NoCoverage] DecrementInteger
Controller/BookController.php:43:5
     }
 
     #[OA\Response(response: 200, description: 'Return book details information', content: new Model(type: BookDetails::class))]
-    #[OA\Response(response: 404, description: 'Book not found')]
+    #[OA\Response(response: 403, description: 'Book not found')]
     #[Route(path: '/api/v1/books/{id}', name: 'book_by_id', methods: 'GET|OPTIONS')]
     public function booksById(int $id): Response

[NoCoverage] IncrementInteger
Controller/BookController.php:43:5
     }
 
     #[OA\Response(response: 200, description: 'Return book details information', content: new Model(type: BookDetails::class))]
-    #[OA\Response(response: 404, description: 'Book not found')]
+    #[OA\Response(response: 405, description: 'Book not found')]
     #[Route(path: '/api/v1/books/{id}', name: 'book_by_id', methods: 'GET|OPTIONS')]
     public function booksById(int $id): Response

[Killed] PublicVisibility
Controller/BookController.php:50:5
         return $this->json($this->bookCategoryService->getBookById($id));
     }
 
-    #[OA\Parameter(name: 'page', description: 'Page Number', in: 'query', schema: new OA\Schema(type: 'integer'))]
+    protected function reviews(int $id, Request $request) : Response
     #[OA\Response(response: 200, description: 'Return book reviews', content: new Model(type: ReviewPage::class))]
     #[OA\Response(response: 404, description: 'Book not found')]
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:08 GMT
X-Robots-Tag:  noindex

[NoCoverage] DecrementInteger
Controller/BookController.php:51:5
     }
 
     #[OA\Parameter(name: 'page', description: 'Page Number', in: 'query', schema: new OA\Schema(type: 'integer'))]
-    #[OA\Response(response: 200, description: 'Return book reviews', content: new Model(type: ReviewPage::class))]
+    #[OA\Response(response: 199, description: 'Return book reviews', content: new Model(type: ReviewPage::class))]
     #[OA\Response(response: 404, description: 'Book not found')]
     #[Route(path: '/api/v1/books/review/{id}', name: 'reviews', methods: 'GET|OPTIONS')]

[NoCoverage] IncrementInteger
Controller/BookController.php:51:5
     }
 
     #[OA\Parameter(name: 'page', description: 'Page Number', in: 'query', schema: new OA\Schema(type: 'integer'))]
-    #[OA\Response(response: 200, description: 'Return book reviews', content: new Model(type: ReviewPage::class))]
+    #[OA\Response(response: 201, description: 'Return book reviews', content: new Model(type: ReviewPage::class))]
     #[OA\Response(response: 404, description: 'Book not found')]
     #[Route(path: '/api/v1/books/review/{id}', name: 'reviews', methods: 'GET|OPTIONS')]

[NoCoverage] DecrementInteger
Controller/BookController.php:52:5
 
     #[OA\Parameter(name: 'page', description: 'Page Number', in: 'query', schema: new OA\Schema(type: 'integer'))]
     #[OA\Response(response: 200, description: 'Return book reviews', content: new Model(type: ReviewPage::class))]
-    #[OA\Response(response: 404, description: 'Book not found')]
+    #[OA\Response(response: 403, description: 'Book not found')]
     #[Route(path: '/api/v1/books/review/{id}', name: 'reviews', methods: 'GET|OPTIONS')]
     public function reviews(int $id, Request $request): Response

[NoCoverage] IncrementInteger
Controller/BookController.php:52:5
 
     #[OA\Parameter(name: 'page', description: 'Page Number', in: 'query', schema: new OA\Schema(type: 'integer'))]
     #[OA\Response(response: 200, description: 'Return book reviews', content: new Model(type: ReviewPage::class))]
-    #[OA\Response(response: 404, description: 'Book not found')]
+    #[OA\Response(response: 405, description: 'Book not found')]
     #[Route(path: '/api/v1/books/review/{id}', name: 'reviews', methods: 'GET|OPTIONS')]
     public function reviews(int $id, Request $request): Response

[Survived] DecrementInteger
Controller/BookController.php:58:13
     {
         return $this->json($this->reviewService->getReviewPageByBookId(
             $id,
-            $request->query->get(key: 'page', default: 1),
+            return $this->json($this->reviewService->getReviewPageByBookId($id, $request->query->get(key: 'page', default: 0)));
         ));
     }

[Survived] IncrementInteger
Controller/BookController.php:58:13
     {
         return $this->json($this->reviewService->getReviewPageByBookId(
             $id,
-            $request->query->get(key: 'page', default: 1),
+            return $this->json($this->reviewService->getReviewPageByBookId($id, $request->query->get(key: 'page', default: 2)));
         ));
     }
