[Killed] PublicVisibility
Controller/SubscriberController.php:21:5
     {
     }
 
-    #[OA\Response(response: 200, description: 'Subscribe email to newsletters mailing list')]
+    protected function subscribe(#[MapRequestPayload] SubscriberRequest $subscriberRequest) : Response
     #[OA\RequestBody(content: new Model(type: SubscriberRequest::class))]
     #[OA\Response(response: 400, description: 'Return 400 error code if email exist', content: new Model(type: ErrorResponse::class))]
killedBy: App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
statusReason: 1) App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
Failed asserting that the Response status code is 422.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:09 GMT
X-Robots-Tag:  noindex

[NoCoverage] IncrementInteger
Controller/SubscriberController.php:21:5
     {
     }
 
-    #[OA\Response(response: 200, description: 'Subscribe email to newsletters mailing list')]
+    #[OA\Response(response: 201, description: 'Subscribe email to newsletters mailing list')]
     #[OA\RequestBody(content: new Model(type: SubscriberRequest::class))]
     #[OA\Response(response: 400, description: 'Return 400 error code if email exist', content: new Model(type: ErrorResponse::class))]

[NoCoverage] IncrementInteger
Controller/SubscriberController.php:23:5
 
     #[OA\Response(response: 200, description: 'Subscribe email to newsletters mailing list')]
     #[OA\RequestBody(content: new Model(type: SubscriberRequest::class))]
-    #[OA\Response(response: 400, description: 'Return 400 error code if email exist', content: new Model(type: ErrorResponse::class))]
+    #[OA\Response(response: 401, description: 'Return 400 error code if email exist', content: new Model(type: ErrorResponse::class))]
     #[OA\Response(response: 422, description: 'Validation errors', content: new Model(type: ErrorResponse::class))]
     #[Route(path: '/api/v1/subscribes', name: 'subscribes', methods: 'POST')]

[NoCoverage] DecrementInteger
Controller/SubscriberController.php:23:5
 
     #[OA\Response(response: 200, description: 'Subscribe email to newsletters mailing list')]
     #[OA\RequestBody(content: new Model(type: SubscriberRequest::class))]
-    #[OA\Response(response: 400, description: 'Return 400 error code if email exist', content: new Model(type: ErrorResponse::class))]
+    #[OA\Response(response: 399, description: 'Return 400 error code if email exist', content: new Model(type: ErrorResponse::class))]
     #[OA\Response(response: 422, description: 'Validation errors', content: new Model(type: ErrorResponse::class))]
     #[Route(path: '/api/v1/subscribes', name: 'subscribes', methods: 'POST')]

[NoCoverage] DecrementInteger
Controller/SubscriberController.php:24:5
     #[OA\Response(response: 200, description: 'Subscribe email to newsletters mailing list')]
     #[OA\RequestBody(content: new Model(type: SubscriberRequest::class))]
     #[OA\Response(response: 400, description: 'Return 400 error code if email exist', content: new Model(type: ErrorResponse::class))]
-    #[OA\Response(response: 422, description: 'Validation errors', content: new Model(type: ErrorResponse::class))]
+    #[OA\Response(response: 421, description: 'Validation errors', content: new Model(type: ErrorResponse::class))]
     #[Route(path: '/api/v1/subscribes', name: 'subscribes', methods: 'POST')]
     public function subscribe(#[MapRequestPayload] SubscriberRequest $subscriberRequest): Response

[NoCoverage] IncrementInteger
Controller/SubscriberController.php:24:5
     #[OA\Response(response: 200, description: 'Subscribe email to newsletters mailing list')]
     #[OA\RequestBody(content: new Model(type: SubscriberRequest::class))]
     #[OA\Response(response: 400, description: 'Return 400 error code if email exist', content: new Model(type: ErrorResponse::class))]
-    #[OA\Response(response: 422, description: 'Validation errors', content: new Model(type: ErrorResponse::class))]
+    #[OA\Response(response: 423, description: 'Validation errors', content: new Model(type: ErrorResponse::class))]
     #[Route(path: '/api/v1/subscribes', name: 'subscribes', methods: 'POST')]
     public function subscribe(#[MapRequestPayload] SubscriberRequest $subscriberRequest): Response

[Survived] MethodCallRemoval
Controller/SubscriberController.php:28:9
     #[Route(path: '/api/v1/subscribes', name: 'subscribes', methods: 'POST')]
     public function subscribe(#[MapRequestPayload] SubscriberRequest $subscriberRequest): Response
     {
-        $this->subscriberService->subscribe($subscriberRequest);
+        
 
         return $this->json(new ErrorResponse(

[Survived] DecrementInteger
Controller/SubscriberController.php:33:9
         return $this->json(new ErrorResponse(
             message: 'Subscriber has been created successfully!',
             details: 'Operation has been completed with no errors'
-        ), 201);
+        return $this->json(new ErrorResponse(message: 'Subscriber has been created successfully!', details: 'Operation has been completed with no errors'), 200);
     }
 }

[Survived] IncrementInteger
Controller/SubscriberController.php:33:9
         return $this->json(new ErrorResponse(
             message: 'Subscriber has been created successfully!',
             details: 'Operation has been completed with no errors'
-        ), 201);
+        return $this->json(new ErrorResponse(message: 'Subscriber has been created successfully!', details: 'Operation has been completed with no errors'), 202);
     }
 }
