[NoCoverage] Foreach_
DataFixtures/BookCategoryFixture.php:21:9
             static::ANDROID_CATEGORY => (new BookCategory())->setTitle('Android')->setSlug('android'),
         ];
 
-        foreach ($categorise as $category) {
-            $manager->persist($category);
-        }
+        foreach (array() as $category) {
 
         $manager->persist((new BookCategory())->setTitle('Data')->setSlug('data'));

[NoCoverage] MethodCallRemoval
DataFixtures/BookCategoryFixture.php:22:13
         ];
 
         foreach ($categorise as $category) {
-            $manager->persist($category);
+            
         }
 

[NoCoverage] MethodCallRemoval
DataFixtures/BookCategoryFixture.php:25:9
             $manager->persist($category);
         }
 
-        $manager->persist((new BookCategory())->setTitle('Data')->setSlug('data'));
+        
         $manager->persist((new BookCategory())->setTitle('IOS')->setSlug('ios'));
 

[NoCoverage] MethodCallRemoval
DataFixtures/BookCategoryFixture.php:26:9
         }
 
         $manager->persist((new BookCategory())->setTitle('Data')->setSlug('data'));
-        $manager->persist((new BookCategory())->setTitle('IOS')->setSlug('ios'));
+        
 
         $manager->flush();

[NoCoverage] MethodCallRemoval
DataFixtures/BookCategoryFixture.php:28:9
         $manager->persist((new BookCategory())->setTitle('Data')->setSlug('data'));
         $manager->persist((new BookCategory())->setTitle('IOS')->setSlug('ios'));
 
-        $manager->flush();
+        
 
         foreach ($categorise as $key => $category) {

[NoCoverage] Foreach_
DataFixtures/BookCategoryFixture.php:30:9
 
         $manager->flush();
 
-        foreach ($categorise as $key => $category) {
-            $this->addReference($key, $category);
-        }
+        foreach (array() as $key => $category) {
     }
 }

[NoCoverage] MethodCallRemoval
DataFixtures/BookCategoryFixture.php:31:13
         $manager->flush();
 
         foreach ($categorise as $key => $category) {
-            $this->addReference($key, $category);
+            
         }
     }
