[Killed] PublicVisibility
Entity/Book.php:77:5
         return $this->title;
     }
 
-    public function setTitle(string $title): static
+    protected function setTitle(string $title) : static
     {
         $this->title = $title;
killedBy: App\Tests\Mapper\BookMapperTest::testMap
statusReason: 1) App\Tests\Mapper\BookMapperTest::testMap
Error: Call to protected method App\Entity\Book::setTitle() from scope App\Tests\Mapper\BookMapperTest

/app/tests/Mapper/BookMapperTest.php:16

2) App\Tests\Service\BookServiceTest::testGetBookById
Error: Call to protected method App\Entity\Book::setTitle() from scope App\Tests\Service\BookServiceTest

[Killed] PublicVisibility
Entity/Book.php:84:5
         return $this;
     }
 
-    public function getSlug(): string
+    protected function getSlug() : string
     {
         return $this->slug;
killedBy: App\Tests\Mapper\BookMapperTest::testMap
statusReason: 1) App\Tests\Controller\BookControllerTest::testBooksByCategory
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:11 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Entity/Book.php:89:5
         return $this->slug;
     }
 
-    public function setSlug(string $slug): static
+    protected function setSlug(string $slug) : static
     {
         $this->slug = $slug;
killedBy: App\Tests\Mapper\BookMapperTest::testMap
statusReason: 1) App\Tests\Mapper\BookMapperTest::testMap
Error: Call to protected method App\Entity\Book::setSlug() from scope App\Tests\Mapper\BookMapperTest

/app/tests/Mapper/BookMapperTest.php:17

2) App\Tests\Service\BookServiceTest::testGetBookById
Error: Call to protected method App\Entity\Book::setSlug() from scope App\Tests\Service\BookServiceTest

[Killed] PublicVisibility
Entity/Book.php:96:5
         return $this;
     }
 
-    public function getImage(): ?string
+    protected function getImage() : ?string
     {
         return $this->image;
killedBy: App\Tests\Mapper\BookMapperTest::testMap
statusReason: 1) App\Tests\Controller\BookControllerTest::testBooksByCategory
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:12 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Entity/Book.php:101:5
         return $this->image;
     }
 
-    public function setImage(?string $image): static
+    protected function setImage(?string $image) : static
     {
         $this->image = $image;
killedBy: App\Tests\Mapper\BookMapperTest::testMap
statusReason: 1) App\Tests\Mapper\BookMapperTest::testMap
Error: Call to protected method App\Entity\Book::setImage() from scope App\Tests\Mapper\BookMapperTest

/app/tests/Mapper/BookMapperTest.php:19

2) App\Tests\Service\BookServiceTest::testGetBookById
Error: Call to protected method App\Entity\Book::setImage() from scope App\Tests\Service\BookServiceTest

[Killed] PublicVisibility
Entity/Book.php:111:5
     /**
      * @return string[]|null
      */
-    public function getAuthors(): ?array
+    protected function getAuthors() : ?array
     {
         return $this->authors;
killedBy: App\Tests\Mapper\BookMapperTest::testMap
statusReason: 1) App\Tests\Controller\BookControllerTest::testBooksByCategory
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:13 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Entity/Book.php:119:5
     /**
      * @param string[] $authors
      */
-    public function setAuthors(?array $authors): static
+    protected function setAuthors(?array $authors) : static
     {
         $this->authors = $authors;
killedBy: App\Tests\Mapper\BookMapperTest::testMap
statusReason: 1) App\Tests\Mapper\BookMapperTest::testMap
Error: Call to protected method App\Entity\Book::setAuthors() from scope App\Tests\Mapper\BookMapperTest

/app/tests/Mapper/BookMapperTest.php:18

2) App\Tests\Service\BookServiceTest::testGetBookById
Error: Call to protected method App\Entity\Book::setAuthors() from scope App\Tests\Service\BookServiceTest

[Killed] PublicVisibility
Entity/Book.php:126:5
         return $this;
     }
 
-    public function getPublicationDate(): ?DateTimeInterface
+    protected function getPublicationDate() : ?DateTimeInterface
     {
         return $this->publicationDate;
killedBy: App\Tests\Mapper\BookMapperTest::testMap
statusReason: 1) App\Tests\Controller\BookControllerTest::testBookById
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:14 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Entity/Book.php:131:5
         return $this->publicationDate;
     }
 
-    public function setPublicationDate(?DateTimeInterface $publicationDate): static
+    protected function setPublicationDate(?DateTimeInterface $publicationDate) : static
     {
         $this->publicationDate = $publicationDate;
killedBy: App\Tests\Mapper\BookMapperTest::testMap
statusReason: 1) App\Tests\Mapper\BookMapperTest::testMap
Error: Call to protected method App\Entity\Book::setPublicationDate() from scope App\Tests\Mapper\BookMapperTest

/app/tests/Mapper/BookMapperTest.php:22

2) App\Tests\Service\BookServiceTest::testGetBookById
Error: Call to protected method App\Entity\Book::setPublicationDate() from scope App\Tests\Service\BookServiceTest

[Killed] PublicVisibility
Entity/Book.php:141:5
     /**
      * @return Collection<BookCategory>
      */
-    public function getCategories(): Collection
+    protected function getCategories() : Collection
     {
         return $this->categories;
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Controller\BookControllerTest::testBookById
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:15 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Entity/Book.php:149:5
     /**
      * @return $this
      */
-    public function setCategories(Collection $categories): static
+    protected function setCategories(Collection $categories) : static
     {
         $this->categories = $categories;
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Service\BookServiceTest::testGetBookById
Error: Call to protected method App\Entity\Book::setCategories() from scope App\Tests\Service\BookServiceTest

/app/tests/Service/BookServiceTest.php:131

2) App\Tests\Service\BookServiceTest::testFindBooksByCategory
Error: Call to protected method App\Entity\Book::setCategories() from scope App\Tests\Service\BookServiceTest

[NoCoverage] PublicVisibility
Entity/Book.php:156:5
         return $this;
     }
 
-    public function getIsbn(): ?string
+    protected function getIsbn() : ?string
     {
         return $this->isbn;

[Killed] PublicVisibility
Entity/Book.php:161:5
         return $this->isbn;
     }
 
-    public function setIsbn(?string $isbn): static
+    protected function setIsbn(?string $isbn) : static
     {
         $this->isbn = $isbn;
killedBy: App\Tests\Mapper\BookMapperTest::testMap
statusReason: 1) App\Tests\Mapper\BookMapperTest::testMap
Error: Call to protected method App\Entity\Book::setIsbn() from scope App\Tests\Mapper\BookMapperTest

/app/tests/Mapper/BookMapperTest.php:20

2) App\Tests\Service\BookServiceTest::testFindBooksByCategory
Error: Call to protected method App\Entity\Book::setIsbn() from scope App\Tests\Service\BookServiceTest

[Killed] PublicVisibility
Entity/Book.php:168:5
         return $this;
     }
 
-    public function getDescription(): ?string
+    protected function getDescription() : ?string
     {
         return $this->description;
statusReason: 1) App\Tests\Controller\BookControllerTest::testBooksByRecommendations
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:16 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Entity/Book.php:173:5
         return $this->description;
     }
 
-    public function setDescription(?string $description): static
+    protected function setDescription(?string $description) : static
     {
         $this->description = $description;
killedBy: App\Tests\Mapper\BookMapperTest::testMap
statusReason: 1) App\Tests\Mapper\BookMapperTest::testMap
Error: Call to protected method App\Entity\Book::setDescription() from scope App\Tests\Mapper\BookMapperTest

/app/tests/Mapper/BookMapperTest.php:21

2) App\Tests\Service\BookServiceTest::testGetBookById
Error: Call to protected method App\Entity\Book::setDescription() from scope App\Tests\Service\BookServiceTest

[Killed] PublicVisibility
Entity/Book.php:180:5
         return $this;
     }
 
-    public function getFormats(): Collection
+    protected function getFormats() : Collection
     {
         return $this->formats;
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Controller\BookControllerTest::testBookById
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:17 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Entity/Book.php:185:5
         return $this->formats;
     }
 
-    public function setFormats(Collection $formats): static
+    protected function setFormats(Collection $formats) : static
     {
         $this->formats = $formats;
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Service\BookServiceTest::testGetBookById
Error: Call to protected method App\Entity\Book::setFormats() from scope App\Tests\Service\BookServiceTest

/app/tests/Service/BookServiceTest.php:132

2) App\Tests\Service\BookServiceTest::testFindBooksByRecommendations with data set #0
Error: Call to protected method App\Entity\Book::setFormats() from scope App\Tests\Service\BookServiceTest

[NoCoverage] PublicVisibility
Entity/Book.php:192:5
         return $this;
     }
 
-    public function getReviews(): Collection
+    protected function getReviews() : Collection
     {
         return $this->reviews;

[NoCoverage] PublicVisibility
Entity/Book.php:197:5
         return $this->reviews;
     }
 
-    public function setReviews(Collection $reviews): static
+    protected function setReviews(Collection $reviews) : static
     {
         $this->reviews = $reviews;
