[Killed] PublicVisibility
Entity/BookCategory.php:39:5
         return $this;
     }
 
-    public function getSlug(): ?string
+    protected function getSlug() : ?string
     {
         return $this->slug;
killedBy: App\Tests\Service\BookCategoryServiceTest::testFindAll
statusReason: 1) App\Tests\Controller\BookCategoryControllerTest::testIndex
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:22 GMT
X-Robots-Tag:  noindex
