[Killed] PublicVisibility
Entity/BookFormat.php:48:5
         return $this->description;
     }
 
-    public function setDescription(string $description): static
+    protected function setDescription(string $description) : static
     {
         $this->description = $description;
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Service\BookServiceTest::testGetBookById
Error: Call to protected method App\Entity\BookFormat::setDescription() from scope App\Tests\Service\BookServiceTest

/app/tests/Service/BookServiceTest.php:121

ERRORS!
Tests: 5, Assertions: 11, Errors: 1.

[Killed] PublicVisibility
Entity/BookFormat.php:55:5
         return $this;
     }
 
-    public function getComment(): ?string
+    protected function getComment() : ?string
     {
         return $this->comment;
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Service\BookServiceTest::testGetBookById
Error: Call to protected method App\Entity\BookFormat::getComment() from scope App\Service\BookService

/app/src/Service/BookService.php:87
/app/vendor/doctrine/collections/src/ArrayCollection.php:361
/app/src/Service/BookService.php:82
/app/tests/Service/BookServiceTest.php:177

[Killed] PublicVisibility
Entity/BookFormat.php:60:5
         return $this->comment;
     }
 
-    public function setComment(string $comment): static
+    protected function setComment(string $comment) : static
     {
         $this->comment = $comment;
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Service\BookServiceTest::testGetBookById
Error: Call to protected method App\Entity\BookFormat::setComment() from scope App\Tests\Service\BookServiceTest

/app/tests/Service/BookServiceTest.php:122

ERRORS!
Tests: 5, Assertions: 11, Errors: 1.
