[Killed] PublicVisibility
Entity/BookRelationToBookFormat.php:36:5
         return $this->id;
     }
 
-    public function getPrice(): ?float
+    protected function getPrice() : ?float
     {
         return $this->price;
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Service\BookServiceTest::testGetBookById
Error: Call to protected method App\Entity\BookRelationToBookFormat::getPrice() from scope App\Service\BookService

/app/src/Service/BookService.php:88
/app/vendor/doctrine/collections/src/ArrayCollection.php:361
/app/src/Service/BookService.php:82
/app/tests/Service/BookServiceTest.php:177

[Killed] PublicVisibility
Entity/BookRelationToBookFormat.php:41:5
         return $this->price;
     }
 
-    public function setPrice(float $price): static
+    protected function setPrice(float $price) : static
     {
         $this->price = $price;
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Service\BookServiceTest::testGetBookById
Error: Call to protected method App\Entity\BookRelationToBookFormat::setPrice() from scope App\Tests\Service\BookServiceTest

/app/tests/Service/BookServiceTest.php:125

ERRORS!
Tests: 5, Assertions: 11, Errors: 1.

[Killed] PublicVisibility
Entity/BookRelationToBookFormat.php:48:5
         return $this;
     }
 
-    public function getDiscountPercent(): ?int
+    protected function getDiscountPercent() : ?int
     {
         return $this->discountPercent;
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Service\BookServiceTest::testGetBookById
Error: Call to protected method App\Entity\BookRelationToBookFormat::getDiscountPercent() from scope App\Service\BookService

/app/src/Service/BookService.php:89
/app/vendor/doctrine/collections/src/ArrayCollection.php:361
/app/src/Service/BookService.php:82
/app/tests/Service/BookServiceTest.php:177

[Killed] PublicVisibility
Entity/BookRelationToBookFormat.php:53:5
         return $this->discountPercent;
     }
 
-    public function setDiscountPercent(int $discountPercent): static
+    protected function setDiscountPercent(int $discountPercent) : static
     {
         $this->discountPercent = $discountPercent;
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Service\BookServiceTest::testGetBookById
Error: Call to protected method App\Entity\BookRelationToBookFormat::setDiscountPercent() from scope App\Tests\Service\BookServiceTest

/app/tests/Service/BookServiceTest.php:125

ERRORS!
Tests: 5, Assertions: 11, Errors: 1.

[NoCoverage] PublicVisibility
Entity/BookRelationToBookFormat.php:60:5
         return $this;
     }
 
-    public function getBook(): Book
+    protected function getBook() : Book
     {
         return $this->book;

[NoCoverage] PublicVisibility
Entity/BookRelationToBookFormat.php:65:5
         return $this->book;
     }
 
-    public function setBook(Book $book): static
+    protected function setBook(Book $book) : static
     {
         $this->book = $book;

[Killed] PublicVisibility
Entity/BookRelationToBookFormat.php:72:5
         return $this;
     }
 
-    public function getFormat(): BookFormat
+    protected function getFormat() : BookFormat
     {
         return $this->format;
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Service\BookServiceTest::testGetBookById
Error: Call to protected method App\Entity\BookRelationToBookFormat::getFormat() from scope App\Service\BookService

/app/src/Service/BookService.php:84
/app/vendor/doctrine/collections/src/ArrayCollection.php:361
/app/src/Service/BookService.php:82
/app/tests/Service/BookServiceTest.php:177

[Killed] PublicVisibility
Entity/BookRelationToBookFormat.php:77:5
         return $this->format;
     }
 
-    public function setFormat(BookFormat $format): static
+    protected function setFormat(BookFormat $format) : static
     {
         $this->format = $format;
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Service\BookServiceTest::testGetBookById
Error: Call to protected method App\Entity\BookRelationToBookFormat::setFormat() from scope App\Tests\Service\BookServiceTest

/app/tests/Service/BookServiceTest.php:125

ERRORS!
Tests: 5, Assertions: 11, Errors: 1.
