[Survived] PublicVisibility
Entity/Review.php:35:5
     #[ORM\ManyToOne(targetEntity: Book::class, inversedBy: 'reviews')]
     private Book $book;
 
-    #[ORM\PrePersist]
+    protected function setCreatedAtValue() : void
     public function setCreatedAtValue(): void
     {

[Killed] PublicVisibility
Entity/Review.php:46:5
         return $this->id;
     }
 
-    public function getRating(): int
+    protected function getRating() : int
     {
         return $this->rating;
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:36 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Entity/Review.php:51:5
         return $this->rating;
     }
 
-    public function setRating(int $rating): static
+    protected function setRating(int $rating) : static
     {
         $this->rating = $rating;
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Error: Call to protected method App\Entity\Review::setRating() from scope App\Tests\Controller\BookControllerTest

/app/tests/Controller/BookControllerTest.php:85

2) App\Tests\Service\ReviewServiceTest::testGetReviewPageByBookIdSuccess with data set #0
Error: Call to protected method App\Entity\Review::setRating() from scope App\Tests\Service

[Killed] PublicVisibility
Entity/Review.php:63:5
         return $this->content;
     }
 
-    public function setContent(string $content): static
+    protected function setContent(string $content) : static
     {
         $this->content = $content;
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Error: Call to protected method App\Entity\Review::setContent() from scope App\Tests\Controller\BookControllerTest

/app/tests/Controller/BookControllerTest.php:86

2) App\Tests\Service\ReviewServiceTest::testGetReviewPageByBookIdSuccess with data set #0
Error: Call to protected method App\Entity\Review::setContent() from scope App\Tests\Servi

[Killed] PublicVisibility
Entity/Review.php:70:5
         return $this;
     }
 
-    public function getAuthor(): string
+    protected function getAuthor() : string
     {
         return $this->author;
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:40 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Entity/Review.php:75:5
         return $this->author;
     }
 
-    public function setAuthor(string $author): static
+    protected function setAuthor(string $author) : static
     {
         $this->author = $author;
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Error: Call to protected method App\Entity\Review::setAuthor() from scope App\Tests\Controller\BookControllerTest

/app/tests/Controller/BookControllerTest.php:87

2) App\Tests\Service\ReviewServiceTest::testGetReviewPageByBookIdSuccess with data set #0
Error: Call to protected method App\Entity\Review::setAuthor() from scope App\Tests\Service

[Killed] PublicVisibility
Entity/Review.php:82:5
         return $this;
     }
 
-    public function getCreatedAt(): DateTimeInterface
+    protected function getCreatedAt() : DateTimeInterface
     {
         return $this->createdAt;
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:41 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Entity/Review.php:87:5
         return $this->createdAt;
     }
 
-    public function setCreatedAt(DateTimeInterface $createdAt): static
+    protected function setCreatedAt(DateTimeInterface $createdAt) : static
     {
         $this->createdAt = $createdAt;
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Error: Call to protected method App\Entity\Review::setCreatedAt() from scope App\Tests\Controller\BookControllerTest

/app/tests/Controller/BookControllerTest.php:88

2) App\Tests\Service\ReviewServiceTest::testGetReviewPageByBookIdSuccess with data set #0
Error: Call to protected method App\Entity\Review::setCreatedAt() from scope App\Tests\S
