[Killed] PublicVisibility
Entity/Subscriber.php:25:5
     #[ORM\Column(type: 'datetime_immutable')]
     private DateTimeInterface $createdAt;
 
-    #[ORM\PrePersist]
+    protected function setCreatedAtValue() : static
     public function setCreatedAtValue(): static
     {
killedBy: App\Tests\Controller\SubscriberControllerTest::testSubscribe
statusReason: 1) App\Tests\Controller\SubscriberControllerTest::testSubscribe
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:43 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Entity/Subscriber.php:38:5
         return $this->id;
     }
 
-    public function setId(int $id): static
+    protected function setId(int $id) : static
     {
         $this->id = $id;
killedBy: App\Tests\Service\SubscriberServiceTest::testSubscribeAlreadyExist
statusReason: 1) App\Tests\Service\SubscriberServiceTest::testSubscribeAlreadyExist
Failed asserting that exception of type "Error" matches expected exception "App\Exception\SubscriberFoundException". Message was: "Call to protected method App\Entity\Subscriber::setId() from scope App\Tests\Service\SubscriberServiceTest" at
/app/tests/Service/SubscriberServiceTest.php:38
.

FAILURES!
Tests: 1, Assertions: 1, Fa

[NoCoverage] PublicVisibility
Entity/Subscriber.php:45:5
         return $this;
     }
 
-    public function getEmail(): string
+    protected function getEmail() : string
     {
         return $this->email;

[Killed] PublicVisibility
Entity/Subscriber.php:50:5
         return $this->email;
     }
 
-    public function setEmail(string $email): static
+    protected function setEmail(string $email) : static
     {
         $this->email = $email;
killedBy: App\Tests\Service\SubscriberServiceTest::testSubscribe
statusReason: 1) App\Tests\Service\SubscriberServiceTest::testSubscribeAlreadyExist
Failed asserting that exception of type "Error" matches expected exception "App\Exception\SubscriberFoundException". Message was: "Call to protected method App\Entity\Subscriber::setEmail() from scope App\Tests\Service\SubscriberServiceTest" at
/app/tests/Service/SubscriberServiceTest.php:38
.

ERRORS!
Tests: 2, Assertions: 1, E
