[NoCoverage] PublicVisibility
Entity/User.php:51:5
         return $this;
     }
 
-    public function getFirstName(): ?string
+    protected function getFirstName() : ?string
     {
         return $this->firstName;

[Killed] PublicVisibility
Entity/User.php:56:5
         return $this->firstName;
     }
 
-    public function setFirstName(?string $firstName): static
+    protected function setFirstName(?string $firstName) : static
     {
         $this->firstName = $firstName;
killedBy: App\Tests\Service\SignUpServiceTest::testSignUp
statusReason: 1) App\Tests\Controller\AuthControllerTest::testSignUp
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:44 GMT
X-Robots-Tag:  noindex

[NoCoverage] PublicVisibility
Entity/User.php:63:5
         return $this;
     }
 
-    public function getLastname(): ?string
+    protected function getLastname() : ?string
     {
         return $this->lastname;

[Killed] PublicVisibility
Entity/User.php:68:5
         return $this->lastname;
     }
 
-    public function setLastname(?string $lastname): static
+    protected function setLastname(?string $lastname) : static
     {
         $this->lastname = $lastname;
killedBy: App\Tests\Service\SignUpServiceTest::testSignUp
statusReason: 1) App\Tests\Controller\AuthControllerTest::testSignUp
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:45 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Entity/User.php:75:5
         return $this;
     }
 
-    public function setPassword(string $password): static
+    protected function setPassword(string $password) : static
     {
         $this->password = $password;
killedBy: App\Tests\Service\SignUpServiceTest::testSignUp
statusReason: 1) App\Tests\Controller\AuthControllerTest::testSignUp
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:45 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Entity/User.php:98:5
     /**
      * @param string[] $roles
      */
-    public function setRoles(array $roles): static
+    protected function setRoles(array $roles) : static
     {
         $this->roles = $roles;
killedBy: App\Tests\Service\RoleServiceTest::testGrantAdmin
statusReason: 1) App\Tests\Controller\AuthControllerTest::testSignUp
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:46 GMT
X-Robots-Tag:  noindex

[Survived] PublicVisibility
Entity/User.php:109:5
     {
     }
 
-    public function getUsername(): string
+    protected function getUsername() : string
     {
         return $this->email;
