[Survived] MethodCallRemoval
Exception/BookCategoryNotFoundException.php:11:9
 {
     public function __construct(string $message = 'Book category not found')
     {
-        parent::__construct($message);
+        
     }
 }
