[Survived] DecrementInteger
Exception/RecommendationAccessDeniedException.php:12:9
 {
     public function __construct(string $message = 'Access Denied', Throwable $previous = null)
     {
-        parent::__construct($message, 0, $previous);
+        parent::__construct($message, -1, $previous);
     }
 }

[Survived] IncrementInteger
Exception/RecommendationAccessDeniedException.php:12:9
 {
     public function __construct(string $message = 'Access Denied', Throwable $previous = null)
     {
-        parent::__construct($message, 0, $previous);
+        parent::__construct($message, 1, $previous);
     }
 }
