[Survived] MethodCallRemoval
Exception/RecommendationRequestException.php:11:9
 {
     public function __construct(string $message = '', Throwable $throwable = null)
     {
-        parent::__construct($message, $throwable);
+        
     }
 }
