[Killed] IfNegation
Listener/ApiExceptionListener.php:32:9
     {
         $throwable = $exceptionEvent->getThrowable();
 
-        if ($this->isSecurityException($throwable)) {
-            return;
-        }
+        if (!$this->isSecurityException($throwable)) {
 
         $mapping = $this->exceptionMappingResolver->resolve(get_class($throwable));
killedBy: App\Tests\Listener\ApiExceptionListenerTest::testNone500MappingWithHiddenMessage
statusReason: 1) App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
Failed asserting that null matches is equal to <text> at JSON path '$.message' and matches is equal to {enable export of objects to see this value} at JSON path '$.details'.

matches is equal to <text> at JSON path '$.message'
matches is equal to {enable export of objects to see this value} at JSON path '$.details'

/app/vend

[Killed] LogicalNot
Listener/ApiExceptionListener.php:38:9
 
         $mapping = $this->exceptionMappingResolver->resolve(get_class($throwable));
 
-        if (!$mapping) {
+        if ($mapping) {
             $mapping = new ExceptionMapping(code: Response::HTTP_INTERNAL_SERVER_ERROR, hidden: true, loggable: false);
         }
killedBy: App\Tests\Listener\ApiExceptionListenerTest::testNone500MappingWithHiddenMessage
statusReason: 1) App\Tests\Listener\ApiExceptionListenerTest::testNone500MappingWithHiddenMessage
Expectation failed for method name is "serialize" when invoked 1 time
Parameter 0 for invocation Symfony\Component\Serializer\SerializerInterface::serialize(App\Model\ErrorResponse Object (...), 'json', []): string does not match expected value.
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@

[NoCoverage] TrueValue
Listener/ApiExceptionListener.php:39:13
         $mapping = $this->exceptionMappingResolver->resolve(get_class($throwable));
 
         if (!$mapping) {
-            $mapping = new ExceptionMapping(code: Response::HTTP_INTERNAL_SERVER_ERROR, hidden: true, loggable: false);
+            $mapping = new ExceptionMapping(code: Response::HTTP_INTERNAL_SERVER_ERROR, hidden: false, loggable: false);
         }
 

[NoCoverage] FalseValue
Listener/ApiExceptionListener.php:39:13
         $mapping = $this->exceptionMappingResolver->resolve(get_class($throwable));
 
         if (!$mapping) {
-            $mapping = new ExceptionMapping(code: Response::HTTP_INTERNAL_SERVER_ERROR, hidden: true, loggable: false);
+            $mapping = new ExceptionMapping(code: Response::HTTP_INTERNAL_SERVER_ERROR, hidden: true, loggable: true);
         }
 

[Survived] GreaterThanOrEqualTo
Listener/ApiExceptionListener.php:42:9
             $mapping = new ExceptionMapping(code: Response::HTTP_INTERNAL_SERVER_ERROR, hidden: true, loggable: false);
         }
 
-        if ($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR || $mapping->isLoggable()) {
+        if ($mapping->getCode() > Response::HTTP_INTERNAL_SERVER_ERROR || $mapping->isLoggable()) {
             $this->logger->error(
                 $throwable->getMessage(),

[Survived] LogicalOr
Listener/ApiExceptionListener.php:42:9
             $mapping = new ExceptionMapping(code: Response::HTTP_INTERNAL_SERVER_ERROR, hidden: true, loggable: false);
         }
 
-        if ($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR || $mapping->isLoggable()) {
+        if ($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR && $mapping->isLoggable()) {
             $this->logger->error(
                 $throwable->getMessage(),

[Survived] MethodCallRemoval
Listener/ApiExceptionListener.php:43:13
         }
 
         if ($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR || $mapping->isLoggable()) {
-            $this->logger->error(
-                $throwable->getMessage(),
-                [
-                    'trace' => $throwable->getTraceAsString(),
-                    'previous' => null !== $throwable->getPrevious() ? $throwable->getPrevious()->getMessage() : '',
-                ]
-            );
+            
         }
 

[Survived] ArrayItemRemoval
Listener/ApiExceptionListener.php:45:17
         if ($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR || $mapping->isLoggable()) {
             $this->logger->error(
                 $throwable->getMessage(),
-                [
-                    'trace' => $throwable->getTraceAsString(),
-                    'previous' => null !== $throwable->getPrevious() ? $throwable->getPrevious()->getMessage() : '',
-                ]
+                $this->logger->error($throwable->getMessage(), ['previous' => null !== $throwable->getPrevious() ? $throwable->getPrevious()->getMessage() : '']);
             );
         }

[Killed] Ternary
Listener/ApiExceptionListener.php:52:9
             );
         }
 
-        $message = $mapping->isHidden() ? Response::$statusTexts[$mapping->getCode()] : $throwable->getMessage();
+        $message = $mapping->isHidden() ? $throwable->getMessage() : Response::$statusTexts[$mapping->getCode()];
         $details = $this->isDebug && !$mapping->isLoggable() ? new ErrorDebugDetails($throwable->getTraceAsString()) : null;
 
killedBy: App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
statusReason: 1) App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
Failed asserting that stdClass Object #1192 (
    'message' => 'Unprocessable Content',
    'details' => null,
) matches is equal to <text> at JSON path '$.message' and matches is equal to {enable export of objects to see this value} at JSON path '$.details'.

matches is equal to <text> at JSON path '$.message'

[Killed] LogicalAndNegation
Listener/ApiExceptionListener.php:53:9
         }
 
         $message = $mapping->isHidden() ? Response::$statusTexts[$mapping->getCode()] : $throwable->getMessage();
-        $details = $this->isDebug && !$mapping->isLoggable() ? new ErrorDebugDetails($throwable->getTraceAsString()) : null;
+        $details = !($this->isDebug && !$mapping->isLoggable()) ? new ErrorDebugDetails($throwable->getTraceAsString()) : null;
 
         $data = $this->serializer->serialize(data: new ErrorResponse($message, $details), format: JsonEncoder::FORMAT);
killedBy: App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
statusReason: 1) App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
Failed asserting that stdClass Object #1557 (
    'message' => 'This value should be of type unknown.\n
This value should not be blank.\n
This value should not be blank.',
    'details' => stdClass Object #1558 (
#1 /app/vendor/symfony/event-dispatcher/EventDispatcher.php(220): Symfony\Component\EventDispatcher\Debug\WrappedL

[Killed] LogicalNot
Listener/ApiExceptionListener.php:53:9
         }
 
         $message = $mapping->isHidden() ? Response::$statusTexts[$mapping->getCode()] : $throwable->getMessage();
-        $details = $this->isDebug && !$mapping->isLoggable() ? new ErrorDebugDetails($throwable->getTraceAsString()) : null;
+        $details = $this->isDebug && $mapping->isLoggable() ? new ErrorDebugDetails($throwable->getTraceAsString()) : null;
 
         $data = $this->serializer->serialize(data: new ErrorResponse($message, $details), format: JsonEncoder::FORMAT);
killedBy: App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
statusReason: 1) App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
Failed asserting that stdClass Object #1196 (
    'message' => 'This value should be of type unknown.\n
This value should not be blank.\n
This value should not be blank.',
    'details' => stdClass Object #1197 (
#1 /app/vendor/symfony/event-dispatcher/EventDispatcher.php(220): Symfony\Component\EventDispatcher\Debug\WrappedL

[Killed] MethodCallRemoval
Listener/ApiExceptionListener.php:57:9
 
         $data = $this->serializer->serialize(data: new ErrorResponse($message, $details), format: JsonEncoder::FORMAT);
 
-        $exceptionEvent->setResponse(new JsonResponse(data: $data, status: $mapping->getCode(), json: true));
+        
     }
 
killedBy: App\Tests\Listener\ApiExceptionListenerTest::testNone500MappingWithHiddenMessage
statusReason: 1) App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
Failed asserting that null matches is equal to <text> at JSON path '$.message' and matches is equal to {enable export of objects to see this value} at JSON path '$.details'.

matches is equal to <text> at JSON path '$.message'
matches is equal to {enable export of objects to see this value} at JSON path '$.details'

/app/vend

[Killed] TrueValue
Listener/ApiExceptionListener.php:57:9
 
         $data = $this->serializer->serialize(data: new ErrorResponse($message, $details), format: JsonEncoder::FORMAT);
 
-        $exceptionEvent->setResponse(new JsonResponse(data: $data, status: $mapping->getCode(), json: true));
+        $exceptionEvent->setResponse(new JsonResponse(data: $data, status: $mapping->getCode(), json: false));
     }
 
killedBy: App\Tests\Listener\ApiExceptionListenerTest::testNone500MappingWithHiddenMessage
statusReason: 1) App\Tests\Listener\ApiExceptionListenerTest::testNone500MappingWithHiddenMessage
Failed asserting that '"{\u0022error\u0022:\u0022Not Found\u0022}"' matches JSON string "{"error":"Not Found"}".
--- Expected
+++ Actual
@@ @@
-{
-    "error": "Not Found"
-}

[Killed] InstanceOf_
Listener/ApiExceptionListener.php:62:9
 
     private function isSecurityException(Throwable $throwable): bool
     {
-        return $throwable instanceof AuthenticationException;
+        return true;
     }
 }
killedBy: App\Tests\Listener\ApiExceptionListenerTest::testNone500MappingWithHiddenMessage
statusReason: 1) App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
Failed asserting that null matches is equal to <text> at JSON path '$.message' and matches is equal to {enable export of objects to see this value} at JSON path '$.details'.

matches is equal to <text> at JSON path '$.message'
matches is equal to {enable export of objects to see this value} at JSON path '$.details'

/app/vend

[Survived] InstanceOf_
Listener/ApiExceptionListener.php:62:9
 
     private function isSecurityException(Throwable $throwable): bool
     {
-        return $throwable instanceof AuthenticationException;
+        return false;
     }
 }
