[Killed] MethodCallRemoval
Listener/JWTCreatedListener.php:17:9
         $payload = $createdEvent->getData();
         $payload['id'] = $user->getId();
 
-        $createdEvent->setData($payload);
+        
     }
 }
killedBy: App\Tests\Controller\AdminControllerTest::testGrantAuthor
statusReason: 1) App\Tests\Controller\AdminControllerTest::testGrantAuthor
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:59 GMT
X-Robots-Tag:  noindex
