[Killed] PublicVisibility
Mapper/BookMapper.php:13:5
 
 class BookMapper
 {
-    public static function map(Book $book, string $viewModel): BookDetails|BookListItem
+    protected static function map(Book $book, string $viewModel) : BookDetails|BookListItem
     {
         return new $viewModel(
killedBy: App\Tests\Mapper\BookMapperTest::testMap
statusReason: 1) App\Tests\Controller\BookControllerTest::testBooksByCategory
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:02:59 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Mapper/BookMapper.php:25:5
         );
     }
 
-    public static function mapRecommendations(Book $book): RecommendedBook
+    protected static function mapRecommendations(Book $book) : RecommendedBook
     {
         $description = (string) $book->getDescription();
statusReason: 1) App\Tests\Controller\BookControllerTest::testBooksByRecommendations
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:03 GMT
X-Robots-Tag:  noindex

[Killed] CastString
Mapper/BookMapper.php:27:9
 
     public static function mapRecommendations(Book $book): RecommendedBook
     {
-        $description = (string) $book->getDescription();
+        $description = $book->getDescription();
         $description = mb_strlen($description) > 150 ? mb_substr($description, 0, 150).'...' : $description;
 
killedBy: App\Tests\Controller\BookControllerTest::testBooksByRecommendations
statusReason: 1) App\Tests\Controller\BookControllerTest::testBooksByRecommendations
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:00 GMT
X-Robots-Tag:  noindex

[Killed] IncrementInteger
Mapper/BookMapper.php:28:9
     public static function mapRecommendations(Book $book): RecommendedBook
     {
         $description = (string) $book->getDescription();
-        $description = mb_strlen($description) > 150 ? mb_substr($description, 0, 150).'...' : $description;
+        $description = mb_strlen($description) > 150 ? mb_substr($description, 1, 150) . '...' : $description;
 
         return (new RecommendedBook())
statusReason: 1) App\Tests\Service\BookServiceTest::testFindBooksByRecommendations with data set #1
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
             'id' => 5
             'title' => 'test'
             'slug' => 'test'

[Killed] GreaterThanNegotiation
Mapper/BookMapper.php:28:9
     public static function mapRecommendations(Book $book): RecommendedBook
     {
         $description = (string) $book->getDescription();
-        $description = mb_strlen($description) > 150 ? mb_substr($description, 0, 150).'...' : $description;
+        $description = mb_strlen($description) <= 150 ? mb_substr($description, 0, 150) . '...' : $description;
 
         return (new RecommendedBook())
statusReason: 1) App\Tests\Service\BookServiceTest::testFindBooksByRecommendations with data set #0
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
             'id' => 5
             'title' => 'test'
             'slug' => 'test'
