[Killed] PublicVisibility
Model/BookCategoryListResponse.php:17:5
     /**
      * @return BookCategoryListItem[]
      */
-    public function getItems(): array
+    protected function getItems() : array
     {
         return $this->items;
killedBy: App\Tests\Controller\BookCategoryControllerTest::testIndex
statusReason: 1) App\Tests\Controller\BookCategoryControllerTest::testIndex
Failed asserting that Array &0 [] matches JSON schema.
[] Array value found, but an object is required

/app/vendor/helmich/phpunit-json-assert/src/JsonAssertions.php:124
/app/tests/Controller/BookCategoryControllerTest.php:19

FAILURES!
