[Survived] OneZeroFloat
Model/BookDetails.php:15:9
         /** @var string[] */
         private array $authors,
         private string $publicationDate,
-        private float $rating = 0.0,
+        private float $rating = 1.0,
         private int $review = 0,
         /** @var BookCategoryListItem[] */

[Survived] DecrementInteger
Model/BookDetails.php:16:9
         private array $authors,
         private string $publicationDate,
         private float $rating = 0.0,
-        private int $review = 0,
+        private int $review = -1,
         /** @var BookCategoryListItem[] */
         private array $categories = [],

[Survived] IncrementInteger
Model/BookDetails.php:16:9
         private array $authors,
         private string $publicationDate,
         private float $rating = 0.0,
-        private int $review = 0,
+        private int $review = 1,
         /** @var BookCategoryListItem[] */
         private array $categories = [],

[Killed] PublicVisibility
Model/BookDetails.php:60:5
         return $this;
     }
 
-    public function getImage(): string
+    protected function getImage() : string
     {
         return $this->image;
killedBy: App\Tests\Controller\BookControllerTest::testBookById
statusReason: 1) App\Tests\Controller\BookControllerTest::testBookById
Failed asserting that stdClass Object #1982 (
    'id' => 962,
    'title' => 'test',
    'slug' => 'test',
    'authors' => Array &0 [
        0 => 'lorem',
    ],

[NoCoverage] PublicVisibility
Model/BookDetails.php:65:5
         return $this->image;
     }
 
-    public function setImage(string $image): static
+    protected function setImage(string $image) : static
     {
         $this->image = $image;

[Killed] PublicVisibility
Model/BookDetails.php:75:5
     /**
      * @return string[]
      */
-    public function getAuthors(): array
+    protected function getAuthors() : array
     {
         return $this->authors;
killedBy: App\Tests\Controller\BookControllerTest::testBookById
statusReason: 1) App\Tests\Controller\BookControllerTest::testBookById
Failed asserting that stdClass Object #1982 (
    'id' => 965,
    'title' => 'test',
    'slug' => 'test',
    'image' => 'default.png',
    'publicationDate' => '2023-12-12T00:00:00+00:00',
    'rating' => 0,

[NoCoverage] PublicVisibility
Model/BookDetails.php:83:5
     /**
      * @param string[] $authors
      */
-    public function setAuthors(array $authors): static
+    protected function setAuthors(array $authors) : static
     {
         $this->authors = $authors;

[Killed] PublicVisibility
Model/BookDetails.php:90:5
         return $this;
     }
 
-    public function getPublicationDate(): string
+    protected function getPublicationDate() : string
     {
         return $this->publicationDate;
killedBy: App\Tests\Controller\BookControllerTest::testBookById
statusReason: 1) App\Tests\Controller\BookControllerTest::testBookById
Failed asserting that stdClass Object #1982 (
    'id' => 968,
    'title' => 'test',
    'slug' => 'test',
    'image' => 'default.png',
    'authors' => Array &0 [
        0 => 'lorem',

[NoCoverage] PublicVisibility
Model/BookDetails.php:95:5
         return $this->publicationDate;
     }
 
-    public function setPublicationDate(string $publicationDate): static
+    protected function setPublicationDate(string $publicationDate) : static
     {
         $this->publicationDate = $publicationDate;

[Killed] PublicVisibility
Model/BookDetails.php:102:5
         return $this;
     }
 
-    public function getRating(): float
+    protected function getRating() : float
     {
         return $this->rating;
killedBy: App\Tests\Controller\BookControllerTest::testBookById
statusReason: 1) App\Tests\Controller\BookControllerTest::testBookById
Failed asserting that stdClass Object #1982 (
    'id' => 971,
    'title' => 'test',
    'slug' => 'test',
    'image' => 'default.png',
    'authors' => Array &0 [
        0 => 'lorem',

[Killed] PublicVisibility
Model/BookDetails.php:107:5
         return $this->rating;
     }
 
-    public function setRating(float $rating): static
+    protected function setRating(float $rating) : static
     {
         $this->rating = $rating;
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Controller\BookControllerTest::testBookById
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:11 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Model/BookDetails.php:114:5
         return $this;
     }
 
-    public function getReview(): int
+    protected function getReview() : int
     {
         return $this->review;
killedBy: App\Tests\Controller\BookControllerTest::testBookById
statusReason: 1) App\Tests\Controller\BookControllerTest::testBookById
Failed asserting that stdClass Object #1982 (
    'id' => 977,
    'title' => 'test',
    'slug' => 'test',
    'image' => 'default.png',
    'authors' => Array &0 [
        0 => 'lorem',

[Killed] PublicVisibility
Model/BookDetails.php:119:5
         return $this->review;
     }
 
-    public function setReview(int $review): static
+    protected function setReview(int $review) : static
     {
         $this->review = $review;
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Controller\BookControllerTest::testBookById
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:12 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Model/BookDetails.php:129:5
     /**
      * @return BookCategoryListItem[]
      */
-    public function getCategories(): array
+    protected function getCategories() : array
     {
         return $this->categories;
killedBy: App\Tests\Controller\BookControllerTest::testBookById
statusReason: 1) App\Tests\Controller\BookControllerTest::testBookById
Failed asserting that stdClass Object #1982 (
    'id' => 983,
    'title' => 'test',
    'slug' => 'test',
    'image' => 'default.png',
    'authors' => Array &0 [
        0 => 'lorem',

[Killed] PublicVisibility
Model/BookDetails.php:137:5
     /**
      * @param BookCategoryListItem[] $categories
      */
-    public function setCategories(array $categories): static
+    protected function setCategories(array $categories) : static
     {
         $this->categories = $categories;
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Controller\BookControllerTest::testBookById
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:13 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Model/BookDetails.php:147:5
     /**
      * @return BookFormatListItem[]
      */
-    public function getFormats(): array
+    protected function getFormats() : array
     {
         return $this->formats;
killedBy: App\Tests\Controller\BookControllerTest::testBookById
statusReason: 1) App\Tests\Controller\BookControllerTest::testBookById
Failed asserting that stdClass Object #1982 (
    'id' => 989,
    'title' => 'test',
    'slug' => 'test',
    'image' => 'default.png',
    'authors' => Array &0 [
        0 => 'lorem',

[Killed] PublicVisibility
Model/BookDetails.php:155:5
     /**
      * @param BookFormatListItem[] $formats
      */
-    public function setFormats(array $formats): static
+    protected function setFormats(array $formats) : static
     {
         $this->formats = $formats;
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Controller\BookControllerTest::testBookById
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:14 GMT
X-Robots-Tag:  noindex
