[Killed] PublicVisibility
Model/BookFormatListItem.php:55:5
         return $this->comment;
     }
 
-    public function setComment(?string $comment): static
+    protected function setComment(?string $comment) : static
     {
         $this->comment = $comment;
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Service\BookServiceTest::testGetBookById
Error: Call to protected method App\Model\BookFormatListItem::setComment() from scope App\Tests\Service\BookServiceTest

/app/tests/Service/BookServiceTest.php:115

ERRORS!
Tests: 5, Assertions: 11, Errors: 1.

[Killed] PublicVisibility
Model/BookFormatListItem.php:79:5
         return $this->discountPercent;
     }
 
-    public function setDiscountPercent(?int $discountPercent): static
+    protected function setDiscountPercent(?int $discountPercent) : static
     {
         $this->discountPercent = $discountPercent;
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Service\BookServiceTest::testGetBookById
Error: Call to protected method App\Model\BookFormatListItem::setDiscountPercent() from scope App\Tests\Service\BookServiceTest

/app/tests/Service/BookServiceTest.php:117

ERRORS!
Tests: 5, Assertions: 11, Errors: 1.
