[NoCoverage] PublicVisibility
Model/ErrorDebugDetails.php:11:5
     {
     }
 
-    public function getTrace(): string
+    protected function getTrace() : string
     {
         return $this->trace;
