[Killed] PublicVisibility
Model/ErrorResponse.php:14:5
     {
     }
 
-    public function getMessage(): string
+    protected function getMessage() : string
     {
         return $this->message;
killedBy: App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
statusReason: 1) App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
Failed asserting that stdClass Object #1176 (
    'details' => null,
) matches is equal to <text> at JSON path '$.message' and matches is equal to {enable export of objects to see this value} at JSON path '$.details'.

matches is equal to <text> at JSON path '$.message'

/app/vendor/helmich/phpunit-json-assert/src/JsonAsserti

[Killed] PublicVisibility
Model/ErrorResponse.php:19:5
         return $this->message;
     }
 
-    #[OA\Property(type: 'object', oneOf: [new OA\Schema(ref: new Model(type: ErrorDebugDetails::class))])]
+    protected function getDetails() : mixed
     public function getDetails(): mixed
     {
killedBy: App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
statusReason: 1) App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
Failed asserting that stdClass Object #1176 (
    'message' => 'This value should be of type unknown.\n
This value should not be blank.\n
This value should not be blank.',
) matches is equal to <text> at JSON path '$.message' and matches is equal to {enable export of objects to see this value} at JSON path '$.details'.

match
