[NoCoverage] PublicVisibility
Model/Recommendation/RecommendationResponse.php:20:5
         return $this->id;
     }
 
-    public function getTs(): int
+    protected function getTs() : int
     {
         return $this->ts;

[Killed] PublicVisibility
Model/Recommendation/RecommendationResponse.php:28:5
     /**
      * @return RecommendationItem[]
      */
-    public function getRecommendations(): array
+    protected function getRecommendations() : array
     {
         return $this->recommendations;
statusReason: 1) App\Tests\Controller\BookControllerTest::testBooksByRecommendations
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:04 GMT
X-Robots-Tag:  noindex
