[Killed] PublicVisibility
Model/Review.php:61:5
         return $this;
     }
 
-    public function getCreatedAt(): string
+    protected function getCreatedAt() : string
     {
         return $this->createdAt;
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that stdClass Object #1335 (
    'items' => Array &0 [
        0 => stdClass Object #1334 (
            'id' => 225,
            'content' => 'test',
            'author' => 'test',
            'rating' => 4,

[Killed] PublicVisibility
Model/Review.php:66:5
         return $this->createdAt;
     }
 
-    public function setCreatedAt(string $createdAt): static
+    protected function setCreatedAt(string $createdAt) : static
     {
         $this->createdAt = $createdAt;
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:27 GMT
X-Robots-Tag:  noindex
