[Killed] PublicVisibility
Model/ReviewPage.php:26:5
     /**
      * @param Review[] $items
      */
-    public function setItems(array $items): static
+    protected function setItems(array $items) : static
     {
         $this->items = $items;
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:28 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Model/ReviewPage.php:45:5
         return $this;
     }
 
-    public function getPage(): int
+    protected function getPage() : int
     {
         return $this->page;
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that stdClass Object #1335 (
    'items' => Array &0 [
        0 => stdClass Object #1334 (
            'id' => 231,
            'content' => 'test',
            'author' => 'test',
            'rating' => 4,

[Killed] PublicVisibility
Model/ReviewPage.php:50:5
         return $this->page;
     }
 
-    public function setPage(int $page): static
+    protected function setPage(int $page) : static
     {
         $this->page = $page;
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:30 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Model/ReviewPage.php:57:5
         return $this;
     }
 
-    public function getPages(): int
+    protected function getPages() : int
     {
         return $this->pages;
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that stdClass Object #2013 (
    'items' => Array &0 [
        0 => stdClass Object #2012 (
            'id' => 233,
            'content' => 'test',
            'author' => 'test',
            'rating' => 4,

[Killed] PublicVisibility
Model/ReviewPage.php:62:5
         return $this->pages;
     }
 
-    public function setPages(int $pages): static
+    protected function setPages(int $pages) : static
     {
         $this->pages = $pages;
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:31 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Model/ReviewPage.php:69:5
         return $this;
     }
 
-    public function getPerPage(): int
+    protected function getPerPage() : int
     {
         return $this->perPage;
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that stdClass Object #1335 (
    'items' => Array &0 [
        0 => stdClass Object #1334 (
            'id' => 235,
            'content' => 'test',
            'author' => 'test',
            'rating' => 4,

[Killed] PublicVisibility
Model/ReviewPage.php:74:5
         return $this->perPage;
     }
 
-    public function setPerPage(int $perPage): static
+    protected function setPerPage(int $perPage) : static
     {
         $this->perPage = $perPage;
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:32 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Model/ReviewPage.php:81:5
         return $this;
     }
 
-    public function getTotal(): int
+    protected function getTotal() : int
     {
         return $this->total;
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that stdClass Object #1683 (
    'items' => Array &0 [
        0 => stdClass Object #1682 (
            'id' => 237,
            'content' => 'test',
            'author' => 'test',
            'rating' => 4,

[Killed] PublicVisibility
Model/ReviewPage.php:86:5
         return $this->total;
     }
 
-    public function setTotal(int $total): static
+    protected function setTotal(int $total) : static
     {
         $this->total = $total;
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:33 GMT
X-Robots-Tag:  noindex
