[Killed] PublicVisibility
Model/SignUpRequest.php:45:5
         return $this->firstName;
     }
 
-    public function setFirstName(string $firstName): static
+    protected function setFirstName(string $firstName) : static
     {
         $this->firstName = $firstName;
killedBy: App\Tests\Service\SignUpServiceTest::testSignUp
statusReason: 1) App\Tests\Controller\AuthControllerTest::testSignUp
Failed asserting that the Response is successful.
HTTP/1.1 422 Unprocessable Content
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:34 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Model/SignUpRequest.php:52:5
         return $this;
     }
 
-    public function getLastname(): string
+    protected function getLastname() : string
     {
         return $this->lastname;
killedBy: App\Tests\Service\SignUpServiceTest::testSignUp
statusReason: 1) App\Tests\Controller\AuthControllerTest::testSignUp
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:35 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Model/SignUpRequest.php:57:5
         return $this->lastname;
     }
 
-    public function setLastname(string $lastname): static
+    protected function setLastname(string $lastname) : static
     {
         $this->lastname = $lastname;
killedBy: App\Tests\Service\SignUpServiceTest::testSignUp
statusReason: 1) App\Tests\Controller\AuthControllerTest::testSignUp
Failed asserting that the Response is successful.
HTTP/1.1 422 Unprocessable Content
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:35 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Model/SignUpRequest.php:64:5
         return $this;
     }
 
-    public function getPassword(): string
+    protected function getPassword() : string
     {
         return $this->password;
killedBy: App\Tests\Service\SignUpServiceTest::testSignUp
statusReason: 1) App\Tests\Controller\AuthControllerTest::testSignUp
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:36 GMT
X-Robots-Tag:  noindex

[NoCoverage] PublicVisibility
Model/SignUpRequest.php:76:5
         return $this;
     }
 
-    public function getConfirmPassword(): string
+    protected function getConfirmPassword() : string
     {
         return $this->confirmPassword;

[Killed] PublicVisibility
Model/SignUpRequest.php:81:5
         return $this->confirmPassword;
     }
 
-    public function setConfirmPassword(string $confirmPassword): static
+    protected function setConfirmPassword(string $confirmPassword) : static
     {
         $this->confirmPassword = $confirmPassword;
killedBy: App\Tests\Service\SignUpServiceTest::testSignUp
statusReason: 1) App\Tests\Controller\AuthControllerTest::testSignUp
Failed asserting that the Response is successful.
HTTP/1.1 422 Unprocessable Content
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:36 GMT
X-Robots-Tag:  noindex
