[NoCoverage] PublicVisibility
Model/SubscriberRequest.php:25:5
         return $this->email;
     }
 
-    public function isAgreed(): bool
+    protected function isAgreed() : bool
     {
         return $this->agreed;
