[NoCoverage] MethodCallRemoval
Repository/BookFormatRepository.php:21:9
 {
     public function __construct(ManagerRegistry $registry)
     {
-        parent::__construct($registry, BookFormat::class);
+        
     }
 }
