[NoCoverage] MethodCallRemoval
Repository/BookRelationToBookFormatRepository.php:21:9
 {
     public function __construct(ManagerRegistry $registry)
     {
-        parent::__construct($registry, BookRelationToBookFormat::class);
+        
     }
 }
