[Killed] MethodCallRemoval
Repository/BookRepository.php:21:9
 {
     public function __construct(ManagerRegistry $registry)
     {
-        parent::__construct($registry, Book::class);
+        
     }
 
killedBy: App\Tests\Repository\BookRepositoryTest::testFindByCategory
statusReason: 1) App\Tests\Controller\BookControllerTest::testBooksByRecommendations
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:38 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Repository/BookRepository.php:27:5
     /**
      * @return Book[]
      */
-    public function findByCategory(int $id): array
+    protected function findByCategory(int $id) : array
     {
         $query = $this->getEntityManager()->createQuery('SELECT b FROM App\Entity\Book b WHERE :categoryId MEMBER OF b.categories');
killedBy: App\Tests\Repository\BookRepositoryTest::testFindByCategory
statusReason: 1) App\Tests\Controller\BookControllerTest::testBooksByCategory
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:38 GMT
X-Robots-Tag:  noindex

[Killed] MethodCallRemoval
Repository/BookRepository.php:30:9
     public function findByCategory(int $id): array
     {
         $query = $this->getEntityManager()->createQuery('SELECT b FROM App\Entity\Book b WHERE :categoryId MEMBER OF b.categories');
-        $query->setParameter('categoryId', $id);
+        
 
         return $query->getResult();
killedBy: App\Tests\Repository\BookRepositoryTest::testFindByCategory
statusReason: 1) App\Tests\Controller\BookControllerTest::testBooksByCategory
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:38 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Repository/BookRepository.php:40:5
      *
      * @return Book[]
      */
-    public function findBooksByIds(array $ids): array
+    protected function findBooksByIds(array $ids) : array
     {
         return $this->findBy(['id' => $ids]);
killedBy: App\Tests\Controller\BookControllerTest::testBooksByRecommendations
statusReason: 1) App\Tests\Controller\BookControllerTest::testBooksByRecommendations
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:39 GMT
X-Robots-Tag:  noindex
