[Killed] MethodCallRemoval
Repository/ReviewRepository.php:26:9
 {
     public function __construct(ManagerRegistry $registry)
     {
-        parent::__construct($registry, Review::class);
+        
     }
 
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:40 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Repository/ReviewRepository.php:33:5
      * @throws NonUniqueResultException
      * @throws NoResultException
      */
-    public function getBookTotalRatingSum(int $id): int
+    protected function getBookTotalRatingSum(int $id) : int
     {
         return (int) $this->getEntityManager()->createQuery(
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:41 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Repository/ReviewRepository.php:40:5
         )->setParameter(key: 'id', value: $id)->getSingleScalarResult();
     }
 
-    public function getPageByBookId(int $id, int $offset, int $limit): Countable&Traversable /* @phpstan-ignore-line */
+    protected function getPageByBookId(int $id, int $offset, int $limit) : Countable&Traversable
     {
         $query = $this->getEntityManager()->createQuery(
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:42 GMT
X-Robots-Tag:  noindex

[Survived] FalseValue
Repository/ReviewRepository.php:46:9
             dql: 'SELECT r FROM App\Entity\Review r WHERE r.book = :id ORDER BY r.createdAt DESC '
         )->setParameter(key: 'id', value: $id)->setFirstResult($offset)->setMaxResults($limit);
 
-        return new Paginator(query: $query, fetchJoinCollection: false);
+        return new Paginator(query: $query, fetchJoinCollection: true);
     }
 

[Killed] NewObject
Repository/ReviewRepository.php:46:9
             dql: 'SELECT r FROM App\Entity\Review r WHERE r.book = :id ORDER BY r.createdAt DESC '
         )->setParameter(key: 'id', value: $id)->setFirstResult($offset)->setMaxResults($limit);
 
-        return new Paginator(query: $query, fetchJoinCollection: false);
+        new Paginator(query: $query, fetchJoinCollection: false);
+        return null;
     }
 
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:42 GMT
X-Robots-Tag:  noindex

[Survived] PublicVisibility
Repository/ReviewRepository.php:49:5
         return new Paginator(query: $query, fetchJoinCollection: false);
     }
 
-    public function countByBook(int $id): int
+    protected function countByBook(int $id) : int
     {
         return $this->count(['book' => $id]);

[Survived] ArrayItemRemoval
Repository/ReviewRepository.php:51:9
 
     public function countByBook(int $id): int
     {
-        return $this->count(['book' => $id]);
+        return $this->count([]);
     }
 }
