[Killed] MethodCallRemoval
Repository/SubscriberRepository.php:21:9
 {
     public function __construct(ManagerRegistry $registry)
     {
-        parent::__construct($registry, Subscriber::class);
+        
     }
 }
killedBy: App\Tests\Controller\SubscriberControllerTest::testSubscribe
statusReason: 1) App\Tests\Controller\SubscriberControllerTest::testSubscribe
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:44 GMT
X-Robots-Tag:  noindex
