[Killed] PublicVisibility
Repository/UserRepository.php:25:5
         parent::__construct($registry, User::class);
     }
 
-    public function existByEmail(string $email): bool
+    protected function existByEmail(string $email) : bool
     {
         return !empty($this->findBy(['email' => $email]));
killedBy: App\Tests\Controller\AuthControllerTest::testSignUp
statusReason: 1) App\Tests\Controller\AuthControllerTest::testSignUp
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:45 GMT
X-Robots-Tag:  noindex

[Killed] LogicalNot
Repository/UserRepository.php:27:9
 
     public function existByEmail(string $email): bool
     {
-        return !empty($this->findBy(['email' => $email]));
+        return empty($this->findBy(['email' => $email]));
     }
 
killedBy: App\Tests\Controller\AuthControllerTest::testSignUp
statusReason: 1) App\Tests\Controller\AuthControllerTest::testSignUp
Failed asserting that the Response is successful.
HTTP/1.1 409 Conflict
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:45 GMT
X-Robots-Tag:  noindex

[Killed] PublicVisibility
Repository/UserRepository.php:30:5
         return !empty($this->findBy(['email' => $email]));
     }
 
-    public function getUser(int $userId): User
+    protected function getUser(int $userId) : User
     {
         $user = $this->find(['id' => $userId]);
killedBy: App\Tests\Controller\AdminControllerTest::testGrantAuthor
statusReason: 1) App\Tests\Controller\AdminControllerTest::testGrantAuthor
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:46 GMT
X-Robots-Tag:  noindex

[NoCoverage] Throw_
Repository/UserRepository.php:35:13
         $user = $this->find(['id' => $userId]);
 
         if (!$user) {
-            throw new UserNotFoundException('User not found');
+            new UserNotFoundException('User not found');
         }
 
