[Killed] PublicVisibility
Service/BookCategoryService.php:17:5
     {
     }
 
-    public function findAll(): BookCategoryListResponse
+    protected function findAll() : BookCategoryListResponse
     {
         $categories = $this->bookCategoryRepository->findBy(criteria: [], orderBy: ['title' => Criteria::ASC]);
killedBy: App\Tests\Service\BookCategoryServiceTest::testFindAll
statusReason: 1) App\Tests\Controller\BookCategoryControllerTest::testIndex
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:04:01 GMT
X-Robots-Tag:  noindex

[Killed] NewObject
Service/BookCategoryService.php:22:13
         $categories = $this->bookCategoryRepository->findBy(criteria: [], orderBy: ['title' => Criteria::ASC]);
 
         $items = array_map(callback: function (BookCategory $bookCategory) {
-            return new BookCategoryListItem(
-                id: $bookCategory->getId(),
-                title: $bookCategory->getTitle(),
-                slug: $bookCategory->getSlug()
-            );
+            new BookCategoryListItem(id: $bookCategory->getId(), title: $bookCategory->getTitle(), slug: $bookCategory->getSlug());
+            return null;
         }, array: $categories);
 
killedBy: App\Tests\Controller\BookCategoryControllerTest::testIndex
statusReason: 1) App\Tests\Controller\BookCategoryControllerTest::testIndex
Failed asserting that stdClass Object #1163 (
    'items' => Array &0 [
        0 => null,
        1 => null,
        2 => null,
        3 => null,
        4 => null,
