[Killed] PublicVisibility
Service/BookService.php:36:5
     ) {
     }
 
-    public function findBooksByCategory(int $categoryId): BookListResponse
+    protected function findBooksByCategory(int $categoryId) : BookListResponse
     {
         $category = $this->bookCategoryRepository->find($categoryId);
killedBy: App\Tests\Service\BookServiceTest::testFindBooksByCategoryNotFound
statusReason: 1) App\Tests\Service\BookServiceTest::testFindBooksByCategoryNotFound
Failed asserting that exception of type "Error" matches expected exception "App\Exception\BookCategoryNotFoundException". Message was: "Call to protected method App\Service\BookService::findBooksByCategory() from scope App\Tests\Service\BookServiceTest" at
/app/tests/Service/BookServiceTest.php:48
.

FAILURES!
Tests: 2, Assertio

[Killed] LogicalNot
Service/BookService.php:40:9
     {
         $category = $this->bookCategoryRepository->find($categoryId);
 
-        if (!$category) {
+        if ($category) {
             throw new BookCategoryNotFoundException();
         }
killedBy: App\Tests\Service\BookServiceTest::testFindBooksByCategory
statusReason: 1) App\Tests\Service\BookServiceTest::testFindBooksByCategoryNotFound
Failed asserting that exception of type "App\Exception\BookCategoryNotFoundException" is thrown.

ERRORS!
Tests: 3, Assertions: 4, Errors: 1, Failures: 1.

[Killed] Throw_
Service/BookService.php:41:13
         $category = $this->bookCategoryRepository->find($categoryId);
 
         if (!$category) {
-            throw new BookCategoryNotFoundException();
+            new BookCategoryNotFoundException();
         }
 
killedBy: App\Tests\Service\BookServiceTest::testFindBooksByCategoryNotFound
statusReason: 1) App\Tests\Service\BookServiceTest::testFindBooksByCategoryNotFound
Failed asserting that exception of type "App\Exception\BookCategoryNotFoundException" is thrown.

FAILURES!
Tests: 3, Assertions: 7, Failures: 1.

[Killed] PublicVisibility
Service/BookService.php:53:5
         );
     }
 
-    public function findBooksByRecommendations(int $idBook): BookListRecommendationResponse
+    protected function findBooksByRecommendations(int $idBook) : BookListRecommendationResponse
     {
         $ids = array_map(
statusReason: 1) App\Tests\Controller\BookControllerTest::testBooksByRecommendations
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:04:03 GMT
X-Robots-Tag:  noindex

[Killed] UnwrapArrayMap
Service/BookService.php:55:9
 
     public function findBooksByRecommendations(int $idBook): BookListRecommendationResponse
     {
-        $ids = array_map(
-            callback: function (RecommendationItem $recommendationItem) {
-                return $recommendationItem->getId();
-            },
-            array: $this->recommendationService->getRecommendationByBookId($idBook)->getRecommendations()
-        );
+        $ids = $this->recommendationService->getRecommendationByBookId($idBook)->getRecommendations();
 
         return new BookListRecommendationResponse(
statusReason: 1) App\Tests\Service\BookServiceTest::testFindBooksByRecommendations with data set #0
Expectation failed for method name is "findBooksByIds" when invoked 1 time
Parameter 0 for invocation App\Repository\BookRepository::findBooksByIds([...]): array does not match expected value.
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (

[Killed] ArrayItemRemoval
Service/BookService.php:63:13
         );
 
         return new BookListRecommendationResponse(
-            array_map([BookMapper::class, 'mapRecommendations'], $this->bookRepository->findBooksByIds($ids))
+            return new BookListRecommendationResponse(array_map(['mapRecommendations'], $this->bookRepository->findBooksByIds($ids)));
         );
     }
statusReason: 1) App\Tests\Controller\BookControllerTest::testBooksByRecommendations
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:04:02 GMT
X-Robots-Tag:  noindex

[Killed] UnwrapArrayMap
Service/BookService.php:63:13
         );
 
         return new BookListRecommendationResponse(
-            array_map([BookMapper::class, 'mapRecommendations'], $this->bookRepository->findBooksByIds($ids))
+            return new BookListRecommendationResponse($this->bookRepository->findBooksByIds($ids));
         );
     }
statusReason: 1) App\Tests\Service\BookServiceTest::testFindBooksByRecommendations with data set #0
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 App\Model\BookListRecommendationResponse Object (
     'items' => Array (
-        0 => App\Model\RecommendedBook Object #546 (

[Killed] PublicVisibility
Service/BookService.php:71:5
      * @throws NonUniqueResultException
      * @throws NoResultException
      */
-    public function getBookById(int $id): BookDetails
+    protected function getBookById(int $id) : BookDetails
     {
         $book = $this->bookRepository->find($id);
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Controller\BookControllerTest::testBookById
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:04:04 GMT
X-Robots-Tag:  noindex

[Killed] LogicalNot
Service/BookService.php:75:9
     {
         $book = $this->bookRepository->find($id);
 
-        if (!$book) {
+        if ($book) {
             throw new BookNotFoundException();
         }
killedBy: App\Tests\Service\BookServiceTest::testGetBookById
statusReason: 1) App\Tests\Controller\BookControllerTest::testBookById
Failed asserting that the Response is successful.
HTTP/1.1 404 Not Found
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:04:03 GMT
X-Robots-Tag:  noindex

[NoCoverage] Throw_
Service/BookService.php:76:13
         $book = $this->bookRepository->find($id);
 
         if (!$book) {
-            throw new BookNotFoundException();
+            new BookNotFoundException();
         }
 

[NoCoverage] NewObject
Service/BookService.php:94:17
 
         $categories = $book->getCategories()
             ->map(func: function (BookCategory $bookCategory) {
-                return new BookCategoryListItem(
-                    id: $bookCategory->getId(),
-                    title: $bookCategory->getTitle(),
-                    slug: $bookCategory->getSlug());
+                new BookCategoryListItem(id: $bookCategory->getId(), title: $bookCategory->getTitle(), slug: $bookCategory->getSlug());
+            return null;());
             });
 
