[Killed] PublicVisibility
Service/ExceptionHandler/ExceptionMapping.php:14:5
     ) {
     }
 
-    public function getCode(): int
+    protected function getCode() : int
     {
         return $this->code;
killedBy: App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testResolveSubClass
statusReason: 1) App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testResolveSubClass
Error: Call to protected method App\Service\ExceptionHandler\ExceptionMapping::getCode() from scope App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest

/app/tests/Service/ExceptionHandler/ExceptionMappingResolverTest.php:43

2) App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testRe

[Killed] PublicVisibility
Service/ExceptionHandler/ExceptionMapping.php:19:5
         return $this->code;
     }
 
-    public function isHidden(): bool
+    protected function isHidden() : bool
     {
         return $this->hidden;
killedBy: App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testResolveClassItself
statusReason: 1) App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testResolveClassItself
Error: Call to protected method App\Service\ExceptionHandler\ExceptionMapping::isHidden() from scope App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest

/app/tests/Service/ExceptionHandler/ExceptionMappingResolverTest.php:34

2) App\Tests\Listener\ApiExceptionListenerTest::testNone500MappingWith

[Killed] PublicVisibility
Service/ExceptionHandler/ExceptionMapping.php:24:5
         return $this->hidden;
     }
 
-    public function isLoggable(): bool
+    protected function isLoggable() : bool
     {
         return $this->loggable;
killedBy: App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testResolveClassItself
statusReason: 1) App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testResolveClassItself
Error: Call to protected method App\Service\ExceptionHandler\ExceptionMapping::isLoggable() from scope App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest

/app/tests/Service/ExceptionHandler/ExceptionMappingResolverTest.php:35

2) App\Tests\Listener\ApiExceptionListenerTest::testNone500MappingWi
