[Killed] Foreach_
Service/ExceptionHandler/ExceptionMappingResolver.php:17:9
      */
     public function __construct(array $mappings)
     {
-        foreach ($mappings as $classKey => $mapping) {
-            if (empty($mapping['code'])) {
-                throw new InvalidArgumentException(sprintf('Code is mandatory for class %s', $classKey));
-            }
-
-            $this->addMapping(
-                class: $classKey,
-                code: $mapping['code'],
-                hidden: $mapping['hidden'] ?? false,
-                loggable: $mapping['loggable'] ?? false
-            );
-        }
+        foreach (array() as $classKey => $mapping) {
     }
 
killedBy: App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testResolveClassItself
statusReason: 1) App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testResolveThrowsExceptionOnEmptyCode
Failed asserting that exception of type "InvalidArgumentException" is thrown.

ERRORS!
Tests: 4, Assertions: 2, Errors: 2, Failures: 1.

[Killed] Throw_
Service/ExceptionHandler/ExceptionMappingResolver.php:19:17
     {
         foreach ($mappings as $classKey => $mapping) {
             if (empty($mapping['code'])) {
-                throw new InvalidArgumentException(sprintf('Code is mandatory for class %s', $classKey));
+                new InvalidArgumentException(sprintf('Code is mandatory for class %s', $classKey));
             }
 
killedBy: App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testResolveThrowsExceptionOnEmptyCode
statusReason: 1) App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testResolveThrowsExceptionOnEmptyCode
/app/src/Service/ExceptionHandler/ExceptionMappingResolver.php:33
/app/src/Service/ExceptionHandler/ExceptionMappingResolver.php:19
/app/tests/Service/ExceptionHandler/ExceptionMappingResolverTest.php:18
.

FAILURES!

[Killed] MethodCallRemoval
Service/ExceptionHandler/ExceptionMappingResolver.php:22:13
                 throw new InvalidArgumentException(sprintf('Code is mandatory for class %s', $classKey));
             }
 
-            $this->addMapping(
-                class: $classKey,
-                code: $mapping['code'],
-                hidden: $mapping['hidden'] ?? false,
-                loggable: $mapping['loggable'] ?? false
-            );
+            
         }
     }
killedBy: App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testResolveSubClass
statusReason: 1) App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
Failed asserting that the Response status code is 422.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:52 GMT
X-Robots-Tag:  noindex

[Killed] FalseValue
Service/ExceptionHandler/ExceptionMappingResolver.php:25:17
             $this->addMapping(
                 class: $classKey,
                 code: $mapping['code'],
-                hidden: $mapping['hidden'] ?? false,
+                $this->addMapping(class: $classKey, code: $mapping['code'], hidden: $mapping['hidden'] ?? true, loggable: $mapping['loggable'] ?? false);
                 loggable: $mapping['loggable'] ?? false
             );
killedBy: App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testResolveClassItself
statusReason: 1) App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testResolveClassItself
Failed asserting that true is false.

/app/tests/Service/ExceptionHandler/ExceptionMappingResolverTest.php:34

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Survived] Coalesce
Service/ExceptionHandler/ExceptionMappingResolver.php:25:17
             $this->addMapping(
                 class: $classKey,
                 code: $mapping['code'],
-                hidden: $mapping['hidden'] ?? false,
+                $this->addMapping(class: $classKey, code: $mapping['code'], hidden: false ?? $mapping['hidden'], loggable: $mapping['loggable'] ?? false);
                 loggable: $mapping['loggable'] ?? false
             );

[Killed] Coalesce
Service/ExceptionHandler/ExceptionMappingResolver.php:26:17
                 class: $classKey,
                 code: $mapping['code'],
                 hidden: $mapping['hidden'] ?? false,
-                loggable: $mapping['loggable'] ?? false
+                $this->addMapping(class: $classKey, code: $mapping['code'], hidden: $mapping['hidden'] ?? false, loggable: false ?? $mapping['loggable']);
             );
         }
killedBy: App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
statusReason: 1) App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
Failed asserting that stdClass Object #1357 (
    'message' => 'This value should be of type unknown.\n
This value should not be blank.\n
This value should not be blank.',
    'details' => stdClass Object #1358 (
#1 /app/vendor/symfony/event-dispatcher/EventDispatcher.php(220): Symfony\Component\EventDispatcher\Debug\WrappedL

[Killed] FalseValue
Service/ExceptionHandler/ExceptionMappingResolver.php:26:17
                 class: $classKey,
                 code: $mapping['code'],
                 hidden: $mapping['hidden'] ?? false,
-                loggable: $mapping['loggable'] ?? false
+                $this->addMapping(class: $classKey, code: $mapping['code'], hidden: $mapping['hidden'] ?? false, loggable: $mapping['loggable'] ?? true);
             );
         }
killedBy: App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testResolveClassItself
statusReason: 1) App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testResolveClassItself
Failed asserting that true is false.

/app/tests/Service/ExceptionHandler/ExceptionMappingResolverTest.php:35

FAILURES!
Tests: 3, Assertions: 5, Failures: 1.

[Killed] PublicVisibility
Service/ExceptionHandler/ExceptionMappingResolver.php:31:5
         }
     }
 
-    public function resolve(string $throwableClass): ?ExceptionMapping
+    protected function resolve(string $throwableClass) : ?ExceptionMapping
     {
         $foundMapping = null;
killedBy: App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testResolveClassItself
statusReason: 1) App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testResolveClassItself
Error: Call to protected method App\Service\ExceptionHandler\ExceptionMappingResolver::resolve() from scope App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest

/app/tests/Service/ExceptionHandler/ExceptionMappingResolverTest.php:31

2) App\Tests\Service\ExceptionHandler\ExceptionMappingResolverT

[Killed] Foreach_
Service/ExceptionHandler/ExceptionMappingResolver.php:35:9
     {
         $foundMapping = null;
 
-        foreach ($this->mappings as $classKey => $mapping) {
-            if ($throwableClass === $classKey || is_subclass_of($throwableClass, $classKey)) {
-                $foundMapping = $mapping;
-                break;
-            }
-        }
+        foreach (array() as $classKey => $mapping) {
 
         return $foundMapping;
killedBy: App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testResolveSubClass
statusReason: 1) App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
Failed asserting that the Response status code is 422.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:55 GMT
X-Robots-Tag:  noindex

[Killed] LogicalOrAllSubExprNegation
Service/ExceptionHandler/ExceptionMappingResolver.php:36:13
         $foundMapping = null;
 
         foreach ($this->mappings as $classKey => $mapping) {
-            if ($throwableClass === $classKey || is_subclass_of($throwableClass, $classKey)) {
+            if (!($throwableClass === $classKey) || !is_subclass_of($throwableClass, $classKey)) {
                 $foundMapping = $mapping;
                 break;
killedBy: App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
statusReason: 1) App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
Failed asserting that the Response status code is 422.
HTTP/1.1 404 Not Found
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:53 GMT
X-Robots-Tag:  noindex

[Killed] Identical
Service/ExceptionHandler/ExceptionMappingResolver.php:36:13
         $foundMapping = null;
 
         foreach ($this->mappings as $classKey => $mapping) {
-            if ($throwableClass === $classKey || is_subclass_of($throwableClass, $classKey)) {
+            if ($throwableClass !== $classKey || is_subclass_of($throwableClass, $classKey)) {
                 $foundMapping = $mapping;
                 break;
killedBy: App\Tests\Service\ExceptionHandler\ExceptionMappingResolverTest::testResolveClassItself
statusReason: 1) App\Tests\Controller\SubscriberControllerTest::testSubscribeNotAgreed
Failed asserting that the Response status code is 422.
HTTP/1.1 404 Not Found
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:52 GMT
X-Robots-Tag:  noindex

[Survived] Break_
Service/ExceptionHandler/ExceptionMappingResolver.php:38:17
         foreach ($this->mappings as $classKey => $mapping) {
             if ($throwableClass === $classKey || is_subclass_of($throwableClass, $classKey)) {
                 $foundMapping = $mapping;
-                break;
+                continue;
             }
         }
