[Killed] PublicVisibility
Service/RatingService.php:13:5
     {
     }
 
-    public function calcReview(int $id, int $total): float
+    protected function calcReview(int $id, int $total) : float
     {
         return $total > 0 ? $this->reviewRepository->getBookTotalRatingSum($id) / $total : 0;
killedBy: App\Tests\Controller\BookControllerTest::testBookById
statusReason: 1) App\Tests\Controller\BookControllerTest::testBookById
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:04:06 GMT
X-Robots-Tag:  noindex

[Killed] IncrementInteger
Service/RatingService.php:15:9
 
     public function calcReview(int $id, int $total): float
     {
-        return $total > 0 ? $this->reviewRepository->getBookTotalRatingSum($id) / $total : 0;
+        return $total > 0 ? $this->reviewRepository->getBookTotalRatingSum($id) / $total : 1;
     }
 }
killedBy: App\Tests\Service\RatingServiceTest::testCalcReviewZeroTotal
statusReason: 1) App\Tests\Service\RatingServiceTest::testCalcReviewZeroTotal
Failed asserting that 1.0 matches expected 0.

/app/tests/Service/RatingServiceTest.php:50

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Ternary
Service/RatingService.php:15:9
 
     public function calcReview(int $id, int $total): float
     {
-        return $total > 0 ? $this->reviewRepository->getBookTotalRatingSum($id) / $total : 0;
+        return $total > 0 ? 0 : $this->reviewRepository->getBookTotalRatingSum($id) / $total;
     }
 }
killedBy: App\Tests\Service\RatingServiceTest::testCalcReviewZeroTotal
statusReason: 1) App\Tests\Service\RatingServiceTest::testCalcReviewZeroTotal
App\Repository\ReviewRepository::getBookTotalRatingSum(1): int was not expected to be called.

/app/src/Service/RatingService.php:13
/app/tests/Service/RatingServiceTest.php:50

--
