[Killed] PublicVisibility
Service/Recommendation/RecommendationService.php:27:5
      * @throws RecommendationAccessDeniedException
      * @throws RecommendationRequestException
      */
-    public function getRecommendationByBookId(int $id): RecommendationResponse
+    protected function getRecommendationByBookId(int $id) : RecommendationResponse
     {
         try {
killedBy: App\Tests\Controller\BookControllerTest::testBooksByRecommendations
statusReason: 1) App\Tests\Controller\BookControllerTest::testBooksByRecommendations
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:59 GMT
X-Robots-Tag:  noindex

[Killed] ConcatOperandRemoval
Service/Recommendation/RecommendationService.php:30:13
     public function getRecommendationByBookId(int $id): RecommendationResponse
     {
         try {
-            $response = $this->recommendationClient->request(method: 'GET', url: '/api/v1/book/'.$id.'/recommendations');
+            $response = $this->recommendationClient->request(method: 'GET', url: $id . '/recommendations');
 
             return $this->serializer->deserialize(
killedBy: App\Tests\Controller\BookControllerTest::testBooksByRecommendations
statusReason: 1) App\Tests\Controller\BookControllerTest::testBooksByRecommendations
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:56 GMT
X-Robots-Tag:  noindex

[Killed] ConcatOperandRemoval
Service/Recommendation/RecommendationService.php:30:13
     public function getRecommendationByBookId(int $id): RecommendationResponse
     {
         try {
-            $response = $this->recommendationClient->request(method: 'GET', url: '/api/v1/book/'.$id.'/recommendations');
+            $response = $this->recommendationClient->request(method: 'GET', url: '/api/v1/book/' . '/recommendations');
 
             return $this->serializer->deserialize(
killedBy: App\Tests\Controller\BookControllerTest::testBooksByRecommendations
statusReason: 1) App\Tests\Controller\BookControllerTest::testBooksByRecommendations
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:03:57 GMT
X-Robots-Tag:  noindex

[Killed] LogicalAndAllSubExprNegation
Service/Recommendation/RecommendationService.php:40:13
         } catch (Throwable $exception) {
             $statusCode = $exception->getCode();
 
-            if ($exception instanceof ClientException && Response::HTTP_FORBIDDEN === $statusCode) {
+            if (!$exception instanceof ClientException && !(Response::HTTP_FORBIDDEN === $statusCode)) {
                 throw new RecommendationAccessDeniedException();
             }
statusReason: 1) App\Tests\Service\Recommendation\RecommendationServiceTest::testGetRecommendationByBookId with data set #0
Failed asserting that exception of type "App\Exception\RecommendationRequestException" matches expected exception "App\Exception\RecommendationAccessDeniedException". Message was: "HTTP 403 returned for "https://example.com/api/v1/book/1/recommendations"." at
/app/vendor/symfony/http-clien

[Killed] LogicalAndNegation
Service/Recommendation/RecommendationService.php:40:13
         } catch (Throwable $exception) {
             $statusCode = $exception->getCode();
 
-            if ($exception instanceof ClientException && Response::HTTP_FORBIDDEN === $statusCode) {
+            if (!($exception instanceof ClientException && Response::HTTP_FORBIDDEN === $statusCode)) {
                 throw new RecommendationAccessDeniedException();
             }
statusReason: 1) App\Tests\Service\Recommendation\RecommendationServiceTest::testGetRecommendationByBookId with data set #0
Failed asserting that exception of type "App\Exception\RecommendationRequestException" matches expected exception "App\Exception\RecommendationAccessDeniedException". Message was: "HTTP 403 returned for "https://example.com/api/v1/book/1/recommendations"." at
/app/vendor/symfony/http-clien

[Killed] Throw_
Service/Recommendation/RecommendationService.php:41:17
             $statusCode = $exception->getCode();
 
             if ($exception instanceof ClientException && Response::HTTP_FORBIDDEN === $statusCode) {
-                throw new RecommendationAccessDeniedException();
+                new RecommendationAccessDeniedException();
             }
 
statusReason: 1) App\Tests\Service\Recommendation\RecommendationServiceTest::testGetRecommendationByBookId with data set #0
Failed asserting that exception of type "App\Exception\RecommendationRequestException" matches expected exception "App\Exception\RecommendationAccessDeniedException". Message was: "HTTP 403 returned for "https://example.com/api/v1/book/1/recommendations"." at
/app/vendor/symfony/http-clien

[Killed] Throw_
Service/Recommendation/RecommendationService.php:44:13
                 throw new RecommendationAccessDeniedException();
             }
 
-            throw new RecommendationRequestException($exception->getMessage(), $exception);
+            new RecommendationRequestException($exception->getMessage(), $exception);
         }
     }
statusReason: 1) App\Tests\Service\Recommendation\RecommendationServiceTest::testGetRecommendationByBookId with data set #1
/app/src/Service/Recommendation/RecommendationService.php:35
/app/tests/Service/Recommendation/RecommendationServiceTest.php:44
.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.
