[Killed] PublicVisibility
Service/ReviewService.php:28:5
      * @throws NoResultException
      * @throws Exception
      */
-    public function getReviewPageByBookId(int $id, int $page): ReviewPage
+    protected function getReviewPageByBookId(int $id, int $page) : ReviewPage
     {
         $offset = max($page - 1, 0) * self::PAGE_LIMIT;
killedBy: App\Tests\Controller\BookControllerTest::testReview
statusReason: 1) App\Tests\Controller\BookControllerTest::testReview
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:04:12 GMT
X-Robots-Tag:  noindex

[Killed] IncrementInteger
Service/ReviewService.php:30:9
      */
     public function getReviewPageByBookId(int $id, int $page): ReviewPage
     {
-        $offset = max($page - 1, 0) * self::PAGE_LIMIT;
+        $offset = max($page - 1, 1) * self::PAGE_LIMIT;
         $paginator = $this->reviewRepository->getPageByBookId(id: $id, offset: $offset, limit: self::PAGE_LIMIT);
         $total = count($paginator);
statusReason: 1) App\Tests\Service\ReviewServiceTest::testGetReviewPageByBookIdInvalidPage with data set #0
Expectation failed for method name is "getPageByBookId" when invoked 1 time
Parameter 1 for invocation App\Repository\ReviewRepository::getPageByBookId(1, 5, 5): Countable&Traversable does not match expected value.
Failed asserting that 5 matches expected 0.

/app/src/Service/ReviewService.php:26
/app/tes

[Killed] Minus
Service/ReviewService.php:30:9
      */
     public function getReviewPageByBookId(int $id, int $page): ReviewPage
     {
-        $offset = max($page - 1, 0) * self::PAGE_LIMIT;
+        $offset = max($page + 1, 0) * self::PAGE_LIMIT;
         $paginator = $this->reviewRepository->getPageByBookId(id: $id, offset: $offset, limit: self::PAGE_LIMIT);
         $total = count($paginator);
statusReason: 1) App\Tests\Service\ReviewServiceTest::testGetReviewPageByBookIdInvalidPage with data set #0
Expectation failed for method name is "getPageByBookId" when invoked 1 time
Parameter 1 for invocation App\Repository\ReviewRepository::getPageByBookId(1, 5, 5): Countable&Traversable does not match expected value.
Failed asserting that 5 matches expected 0.

/app/src/Service/ReviewService.php:26
/app/tes

[Killed] Foreach_
Service/ReviewService.php:35:9
         $total = count($paginator);
         $items = [];
 
-        foreach ($paginator as $item) {
-            $items[] = $this->map($item);
-        }
+        foreach (array() as $item) {
 
         return (new ReviewPage())
statusReason: 1) App\Tests\Service\ReviewServiceTest::testGetReviewPageByBookIdSuccess with data set #0
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 App\Model\ReviewPage Object (
     'items' => Array (
-        0 => App\Model\Review Object (...)

[Survived] PublicVisibility
Service/ReviewService.php:49:5
         ;
     }
 
-    public function map(Review $review): ReviewModel
+    protected function map(Review $review) : ReviewModel
     {
         return (new ReviewModel())
