[Killed] PublicVisibility
Service/RoleService.php:16:5
     ) {
     }
 
-    public function grantAdmin(int $userId): void
+    protected function grantAdmin(int $userId) : void
     {
         $this->grantRole($userId, 'ROLE_ADMIN');
killedBy: App\Tests\Service\RoleServiceTest::testGrantAdmin
statusReason: 1) App\Tests\Service\RoleServiceTest::testGrantAdmin
Error: Call to protected method App\Service\RoleService::grantAdmin() from scope App\Tests\Service\RoleServiceTest

/app/tests/Service/RoleServiceTest.php:34

ERRORS!
Tests: 2, Assertions: 3, Errors: 1.

[Killed] MethodCallRemoval
Service/RoleService.php:18:9
 
     public function grantAdmin(int $userId): void
     {
-        $this->grantRole($userId, 'ROLE_ADMIN');
+        
     }
 
killedBy: App\Tests\Service\RoleServiceTest::testGrantAdmin
statusReason: 1) App\Tests\Service\RoleServiceTest::testGrantAdmin
Error: Typed property App\Entity\User::$roles must not be accessed before initialization

/app/src/Entity/User.php:92
/app/tests/Service/RoleServiceTest.php:36

ERRORS!
Tests: 2, Assertions: 3, Errors: 1.

[Killed] PublicVisibility
Service/RoleService.php:21:5
         $this->grantRole($userId, 'ROLE_ADMIN');
     }
 
-    public function grantAuthor(int $userId): void
+    protected function grantAuthor(int $userId) : void
     {
         $this->grantRole($userId, 'ROLE_AUTHOR');
killedBy: App\Tests\Service\RoleServiceTest::testGrantAuthor
statusReason: 1) App\Tests\Controller\AdminControllerTest::testGrantAuthor
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:04:14 GMT
X-Robots-Tag:  noindex

[Killed] MethodCallRemoval
Service/RoleService.php:23:9
 
     public function grantAuthor(int $userId): void
     {
-        $this->grantRole($userId, 'ROLE_AUTHOR');
+        
     }
 
killedBy: App\Tests\Service\RoleServiceTest::testGrantAuthor
statusReason: 1) App\Tests\Service\RoleServiceTest::testGrantAuthor
Error: Typed property App\Entity\User::$roles must not be accessed before initialization

/app/src/Entity/User.php:92
/app/tests/Service/RoleServiceTest.php:43

ERRORS!
Tests: 3, Assertions: 5, Errors: 1.

[Killed] MethodCallRemoval
Service/RoleService.php:29:9
     private function grantRole(int $userId, string $role): void
     {
         $user = $this->userRepository->getUser($userId);
-        $user->setRoles([$role]);
+        
 
         $this->entityManager->persist($user);
killedBy: App\Tests\Service\RoleServiceTest::testGrantAuthor
statusReason: 1) App\Tests\Service\RoleServiceTest::testGrantAuthor
Error: Typed property App\Entity\User::$roles must not be accessed before initialization

/app/src/Entity/User.php:92
/app/tests/Service/RoleServiceTest.php:43

2) App\Tests\Service\RoleServiceTest::testGrantAdmin
Error: Typed property App\Entity\User::$roles must not be accessed before initialization

[Survived] MethodCallRemoval
Service/RoleService.php:31:9
         $user = $this->userRepository->getUser($userId);
         $user->setRoles([$role]);
 
-        $this->entityManager->persist($user);
+        
         $this->entityManager->flush();
     }

[Killed] MethodCallRemoval
Service/RoleService.php:32:9
         $user->setRoles([$role]);
 
         $this->entityManager->persist($user);
-        $this->entityManager->flush();
+        
     }
 }
killedBy: App\Tests\Service\RoleServiceTest::testGrantAuthor
statusReason: 1) App\Tests\Service\RoleServiceTest::testGrantAuthor
Expectation failed for method name is "flush" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
