[Killed] PublicVisibility
Service/SignUpService.php:24:5
     ) {
     }
 
-    public function signUp(SignUpRequest $signUpRequest): Response
+    protected function signUp(SignUpRequest $signUpRequest) : Response
     {
         if ($this->userRepository->existByEmail($signUpRequest->getEmail())) {
killedBy: App\Tests\Service\SignUpServiceTest::testSignUpUserAlreadyExist
statusReason: 1) App\Tests\Service\SignUpServiceTest::testSignUpUserAlreadyExist
Failed asserting that exception of type "Error" matches expected exception "App\Exception\UserAlreadyExistException". Message was: "Call to protected method App\Service\SignUpService::signUp() from scope App\Tests\Service\SignUpServiceTest" at
/app/tests/Service/SignUpServiceTest.php:49
.

FAILURES!
Tests: 1, Assertions: 1, Failure

[Killed] IfNegation
Service/SignUpService.php:26:9
 
     public function signUp(SignUpRequest $signUpRequest): Response
     {
-        if ($this->userRepository->existByEmail($signUpRequest->getEmail())) {
-            throw new UserAlreadyExistException();
-        }
+        if (!$this->userRepository->existByEmail($signUpRequest->getEmail())) {
 
         $user = (new User())
killedBy: App\Tests\Service\SignUpServiceTest::testSignUp
statusReason: 1) App\Tests\Service\SignUpServiceTest::testSignUpUserAlreadyExist
Failed asserting that exception of type "Error" matches expected exception "App\Exception\UserAlreadyExistException". Message was: "Typed property App\Model\SignUpRequest::$lastname must not be accessed before initialization" at
/app/src/Model/SignUpRequest.php:54
/app/src/Service/SignUpService.php:23
/app/tests/Service/SignUpServi

[Killed] Throw_
Service/SignUpService.php:27:13
     public function signUp(SignUpRequest $signUpRequest): Response
     {
         if ($this->userRepository->existByEmail($signUpRequest->getEmail())) {
-            throw new UserAlreadyExistException();
+            new UserAlreadyExistException();
         }
 
killedBy: App\Tests\Service\SignUpServiceTest::testSignUpUserAlreadyExist
statusReason: 1) App\Tests\Service\SignUpServiceTest::testSignUpUserAlreadyExist
Failed asserting that exception of type "Error" matches expected exception "App\Exception\UserAlreadyExistException". Message was: "Typed property App\Model\SignUpRequest::$lastname must not be accessed before initialization" at
/app/src/Model/SignUpRequest.php:54
/app/src/Service/SignUpService.php:23
/app/tests/Service/SignUpServi

[Killed] MethodCallRemoval
Service/SignUpService.php:37:9
             ->setFirstName($signUpRequest->getFirstName()
             );
 
-        $user->setPassword($this->passwordHasher->hashPassword($user, $signUpRequest->getPassword()));
+        
 
         $this->entityManager->persist($user);
killedBy: App\Tests\Service\SignUpServiceTest::testSignUp
statusReason: 1) App\Tests\Service\SignUpServiceTest::testSignUp
Expectation failed for method name is "persist" when invoked 1 time
Parameter 0 for invocation Doctrine\Persistence\ObjectManager::persist(App\Entity\User Object (...)) does not match expected value.
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
     'email' => 'test@gmail.com'
