[Killed] PublicVisibility
Service/SubscriberService.php:19:5
     ) {
     }
 
-    public function subscribe(SubscriberRequest $subscriberRequest): void
+    protected function subscribe(SubscriberRequest $subscriberRequest) : void
     {
         $subscriber = $this->subscriberRepository->findOneBy(['email' => $subscriberRequest->getEmail()]);
killedBy: App\Tests\Controller\SubscriberControllerTest::testSubscribe
statusReason: 1) App\Tests\Controller\SubscriberControllerTest::testSubscribe
Failed asserting that the Response is successful.
HTTP/1.1 500 Internal Server Error
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:04:19 GMT
X-Robots-Tag:  noindex

[Killed] ArrayItem
Service/SubscriberService.php:21:9
 
     public function subscribe(SubscriberRequest $subscriberRequest): void
     {
-        $subscriber = $this->subscriberRepository->findOneBy(['email' => $subscriberRequest->getEmail()]);
+        $subscriber = $this->subscriberRepository->findOneBy(['email' > $subscriberRequest->getEmail()]);
 
         if ($subscriber) {
killedBy: App\Tests\Service\SubscriberServiceTest::testSubscribe
statusReason: 1) App\Tests\Service\SubscriberServiceTest::testSubscribe
Expectation failed for method name is "findOneBy" when invoked 1 time
Parameter 0 for invocation Doctrine\ORM\EntityRepository::findOneBy([...], null) does not match expected value.
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (

[Killed] IfNegation
Service/SubscriberService.php:23:9
     {
         $subscriber = $this->subscriberRepository->findOneBy(['email' => $subscriberRequest->getEmail()]);
 
-        if ($subscriber) {
-            throw new SubscriberFoundException();
-        }
+        if (!$subscriber) {
 
         $this->entityManager->persist((new Subscriber())->setEmail($subscriberRequest->getEmail()));
killedBy: App\Tests\Controller\SubscriberControllerTest::testSubscribe
statusReason: 1) App\Tests\Controller\SubscriberControllerTest::testSubscribe
Failed asserting that the Response is successful.
HTTP/1.1 400 Bad Request
Cache-Control: no-cache, private
Content-Type:  application/json
Date:          Tue, 05 Dec 2023 17:04:18 GMT
X-Robots-Tag:  noindex

[Killed] Throw_
Service/SubscriberService.php:24:13
         $subscriber = $this->subscriberRepository->findOneBy(['email' => $subscriberRequest->getEmail()]);
 
         if ($subscriber) {
-            throw new SubscriberFoundException();
+            new SubscriberFoundException();
         }
 
killedBy: App\Tests\Service\SubscriberServiceTest::testSubscribeAlreadyExist
statusReason: 1) App\Tests\Service\SubscriberServiceTest::testSubscribeAlreadyExist
Failed asserting that exception of type "App\Exception\SubscriberFoundException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Service/SubscriberService.php:27:9
             throw new SubscriberFoundException();
         }
 
-        $this->entityManager->persist((new Subscriber())->setEmail($subscriberRequest->getEmail()));
+        
         $this->entityManager->flush();
     }
killedBy: App\Tests\Service\SubscriberServiceTest::testSubscribe
statusReason: 1) App\Tests\Service\SubscriberServiceTest::testSubscribe
Expectation failed for method name is "persist" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

Remaining indirect deprecation notices (3)

[Killed] MethodCallRemoval
Service/SubscriberService.php:28:9
         }
 
         $this->entityManager->persist((new Subscriber())->setEmail($subscriberRequest->getEmail()));
-        $this->entityManager->flush();
+        
     }
 }
killedBy: App\Tests\Service\SubscriberServiceTest::testSubscribe
statusReason: 1) App\Tests\Service\SubscriberServiceTest::testSubscribe
Expectation failed for method name is "flush" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

Remaining indirect deprecation notices (3)
