2) /app/src/Controller/AdminController.php:26    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function grantAuthor(int $userId) : Response
     {
         $this->roleService->grantAuthor($userId);
-        return new Response('', 201);
+        return new Response('', 200);
     }
 }

3) /app/src/Controller/AdminController.php:26    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function grantAuthor(int $userId) : Response
     {
         $this->roleService->grantAuthor($userId);
-        return new Response('', 201);
+        return new Response('', 202);
     }
 }

4) /app/src/Controller/BookController.php:58    [M] DecrementInteger

--- Original
+++ New
@@ @@
     #[Route(path: '/api/v1/books/review/{id}', name: 'reviews', methods: 'GET|OPTIONS')]
     public function reviews(int $id, Request $request) : Response
     {
-        return $this->json($this->reviewService->getReviewPageByBookId($id, $request->query->get(key: 'page', default: 1)));
+        return $this->json($this->reviewService->getReviewPageByBookId($id, $request->query->get(key: 'page', default: 0)));
     }
 }

5) /app/src/Controller/BookController.php:58    [M] IncrementInteger

--- Original
+++ New
@@ @@
     #[Route(path: '/api/v1/books/review/{id}', name: 'reviews', methods: 'GET|OPTIONS')]
     public function reviews(int $id, Request $request) : Response
     {
-        return $this->json($this->reviewService->getReviewPageByBookId($id, $request->query->get(key: 'page', default: 1)));
+        return $this->json($this->reviewService->getReviewPageByBookId($id, $request->query->get(key: 'page', default: 2)));
     }
 }

7) /app/src/Controller/SubscriberController.php:33    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function subscribe(#[MapRequestPayload] SubscriberRequest $subscriberRequest) : Response
     {
         $this->subscriberService->subscribe($subscriberRequest);
-        return $this->json(new ErrorResponse(message: 'Subscriber has been created successfully!', details: 'Operation has been completed with no errors'), 201);
+        return $this->json(new ErrorResponse(message: 'Subscriber has been created successfully!', details: 'Operation has been completed with no errors'), 200);
     }
 }

8) /app/src/Controller/SubscriberController.php:33    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function subscribe(#[MapRequestPayload] SubscriberRequest $subscriberRequest) : Response
     {
         $this->subscriberService->subscribe($subscriberRequest);
-        return $this->json(new ErrorResponse(message: 'Subscriber has been created successfully!', details: 'Operation has been completed with no errors'), 201);
+        return $this->json(new ErrorResponse(message: 'Subscriber has been created successfully!', details: 'Operation has been completed with no errors'), 202);
     }
 }

10) /app/src/Entity/Review.php:35    [M] PublicVisibility

--- Original
+++ New
@@ @@
     #[ORM\ManyToOne(targetEntity: Book::class, inversedBy: 'reviews')]
     private Book $book;
     #[ORM\PrePersist]
-    public function setCreatedAtValue() : void
+    protected function setCreatedAtValue() : void
     {
         $this->createdAt = new DateTimeImmutable();
     }

11) /app/src/Entity/User.php:109    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function eraseCredentials() : void
     {
     }
-    public function getUsername() : string
+    protected function getUsername() : string
     {
         return $this->email;
     }

15) /app/src/Exception/RecommendationAccessDeniedException.php:12    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function __construct(string $message = 'Access Denied', Throwable $previous = null)
     {
-        parent::__construct($message, 0, $previous);
+        
     }
 }

22) /app/src/Listener/ApiExceptionListener.php:42    [M] GreaterThanOrEqualTo

--- Original
+++ New
@@ @@
         if (!$mapping) {
             $mapping = new ExceptionMapping(code: Response::HTTP_INTERNAL_SERVER_ERROR, hidden: true, loggable: false);
         }
-        if ($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR || $mapping->isLoggable()) {
+        if ($mapping->getCode() > Response::HTTP_INTERNAL_SERVER_ERROR || $mapping->isLoggable()) {
             $this->logger->error($throwable->getMessage(), ['trace' => $throwable->getTraceAsString(), 'previous' => null !== $throwable->getPrevious() ? $throwable->getPrevious()->getMessage() : '']);
         }
         $message = $mapping->isHidden() ? Response::$statusTexts[$mapping->getCode()] : $throwable->getMessage();

23) /app/src/Listener/ApiExceptionListener.php:42    [M] GreaterThanOrEqualToNegotiation

--- Original
+++ New
@@ @@
         if (!$mapping) {
             $mapping = new ExceptionMapping(code: Response::HTTP_INTERNAL_SERVER_ERROR, hidden: true, loggable: false);
         }
-        if ($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR || $mapping->isLoggable()) {
+        if ($mapping->getCode() < Response::HTTP_INTERNAL_SERVER_ERROR || $mapping->isLoggable()) {
             $this->logger->error($throwable->getMessage(), ['trace' => $throwable->getTraceAsString(), 'previous' => null !== $throwable->getPrevious() ? $throwable->getPrevious()->getMessage() : '']);
         }
         $message = $mapping->isHidden() ? Response::$statusTexts[$mapping->getCode()] : $throwable->getMessage();

24) /app/src/Listener/ApiExceptionListener.php:42    [M] LogicalOr

--- Original
+++ New
@@ @@
         if (!$mapping) {
             $mapping = new ExceptionMapping(code: Response::HTTP_INTERNAL_SERVER_ERROR, hidden: true, loggable: false);
         }
-        if ($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR || $mapping->isLoggable()) {
+        if ($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR && $mapping->isLoggable()) {
             $this->logger->error($throwable->getMessage(), ['trace' => $throwable->getTraceAsString(), 'previous' => null !== $throwable->getPrevious() ? $throwable->getPrevious()->getMessage() : '']);
         }
         $message = $mapping->isHidden() ? Response::$statusTexts[$mapping->getCode()] : $throwable->getMessage();

25) /app/src/Listener/ApiExceptionListener.php:42    [M] LogicalOrAllSubExprNegation

--- Original
+++ New
@@ @@
         if (!$mapping) {
             $mapping = new ExceptionMapping(code: Response::HTTP_INTERNAL_SERVER_ERROR, hidden: true, loggable: false);
         }
-        if ($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR || $mapping->isLoggable()) {
+        if (!($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR) || !$mapping->isLoggable()) {
             $this->logger->error($throwable->getMessage(), ['trace' => $throwable->getTraceAsString(), 'previous' => null !== $throwable->getPrevious() ? $throwable->getPrevious()->getMessage() : '']);
         }
         $message = $mapping->isHidden() ? Response::$statusTexts[$mapping->getCode()] : $throwable->getMessage();

26) /app/src/Listener/ApiExceptionListener.php:42    [M] LogicalOrNegation

--- Original
+++ New
@@ @@
         if (!$mapping) {
             $mapping = new ExceptionMapping(code: Response::HTTP_INTERNAL_SERVER_ERROR, hidden: true, loggable: false);
         }
-        if ($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR || $mapping->isLoggable()) {
+        if (!($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR || $mapping->isLoggable())) {
             $this->logger->error($throwable->getMessage(), ['trace' => $throwable->getTraceAsString(), 'previous' => null !== $throwable->getPrevious() ? $throwable->getPrevious()->getMessage() : '']);
         }
         $message = $mapping->isHidden() ? Response::$statusTexts[$mapping->getCode()] : $throwable->getMessage();

27) /app/src/Listener/ApiExceptionListener.php:42    [M] LogicalOrSingleSubExprNegation

--- Original
+++ New
@@ @@
         if (!$mapping) {
             $mapping = new ExceptionMapping(code: Response::HTTP_INTERNAL_SERVER_ERROR, hidden: true, loggable: false);
         }
-        if ($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR || $mapping->isLoggable()) {
+        if ($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR || !$mapping->isLoggable()) {
             $this->logger->error($throwable->getMessage(), ['trace' => $throwable->getTraceAsString(), 'previous' => null !== $throwable->getPrevious() ? $throwable->getPrevious()->getMessage() : '']);
         }
         $message = $mapping->isHidden() ? Response::$statusTexts[$mapping->getCode()] : $throwable->getMessage();

28) /app/src/Listener/ApiExceptionListener.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $mapping = new ExceptionMapping(code: Response::HTTP_INTERNAL_SERVER_ERROR, hidden: true, loggable: false);
         }
         if ($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR || $mapping->isLoggable()) {
-            $this->logger->error($throwable->getMessage(), ['trace' => $throwable->getTraceAsString(), 'previous' => null !== $throwable->getPrevious() ? $throwable->getPrevious()->getMessage() : '']);
+            
         }
         $message = $mapping->isHidden() ? Response::$statusTexts[$mapping->getCode()] : $throwable->getMessage();
         $details = $this->isDebug && !$mapping->isLoggable() ? new ErrorDebugDetails($throwable->getTraceAsString()) : null;

29) /app/src/Listener/ApiExceptionListener.php:45    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $mapping = new ExceptionMapping(code: Response::HTTP_INTERNAL_SERVER_ERROR, hidden: true, loggable: false);
         }
         if ($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR || $mapping->isLoggable()) {
-            $this->logger->error($throwable->getMessage(), ['trace' => $throwable->getTraceAsString(), 'previous' => null !== $throwable->getPrevious() ? $throwable->getPrevious()->getMessage() : '']);
+            $this->logger->error($throwable->getMessage(), ['previous' => null !== $throwable->getPrevious() ? $throwable->getPrevious()->getMessage() : '']);
         }
         $message = $mapping->isHidden() ? Response::$statusTexts[$mapping->getCode()] : $throwable->getMessage();
         $details = $this->isDebug && !$mapping->isLoggable() ? new ErrorDebugDetails($throwable->getTraceAsString()) : null;

30) /app/src/Listener/ApiExceptionListener.php:46    [M] ArrayItem

--- Original
+++ New
@@ @@
             $mapping = new ExceptionMapping(code: Response::HTTP_INTERNAL_SERVER_ERROR, hidden: true, loggable: false);
         }
         if ($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR || $mapping->isLoggable()) {
-            $this->logger->error($throwable->getMessage(), ['trace' => $throwable->getTraceAsString(), 'previous' => null !== $throwable->getPrevious() ? $throwable->getPrevious()->getMessage() : '']);
+            $this->logger->error($throwable->getMessage(), ['trace' > $throwable->getTraceAsString(), 'previous' => null !== $throwable->getPrevious() ? $throwable->getPrevious()->getMessage() : '']);
         }
         $message = $mapping->isHidden() ? Response::$statusTexts[$mapping->getCode()] : $throwable->getMessage();
         $details = $this->isDebug && !$mapping->isLoggable() ? new ErrorDebugDetails($throwable->getTraceAsString()) : null;

31) /app/src/Listener/ApiExceptionListener.php:47    [M] NotIdentical

--- Original
+++ New
@@ @@
             $mapping = new ExceptionMapping(code: Response::HTTP_INTERNAL_SERVER_ERROR, hidden: true, loggable: false);
         }
         if ($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR || $mapping->isLoggable()) {
-            $this->logger->error($throwable->getMessage(), ['trace' => $throwable->getTraceAsString(), 'previous' => null !== $throwable->getPrevious() ? $throwable->getPrevious()->getMessage() : '']);
+            $this->logger->error($throwable->getMessage(), ['trace' => $throwable->getTraceAsString(), 'previous' => null === $throwable->getPrevious() ? $throwable->getPrevious()->getMessage() : '']);
         }
         $message = $mapping->isHidden() ? Response::$statusTexts[$mapping->getCode()] : $throwable->getMessage();
         $details = $this->isDebug && !$mapping->isLoggable() ? new ErrorDebugDetails($throwable->getTraceAsString()) : null;

32) /app/src/Listener/ApiExceptionListener.php:47    [M] Ternary

--- Original
+++ New
@@ @@
             $mapping = new ExceptionMapping(code: Response::HTTP_INTERNAL_SERVER_ERROR, hidden: true, loggable: false);
         }
         if ($mapping->getCode() >= Response::HTTP_INTERNAL_SERVER_ERROR || $mapping->isLoggable()) {
-            $this->logger->error($throwable->getMessage(), ['trace' => $throwable->getTraceAsString(), 'previous' => null !== $throwable->getPrevious() ? $throwable->getPrevious()->getMessage() : '']);
+            $this->logger->error($throwable->getMessage(), ['trace' => $throwable->getTraceAsString(), 'previous' => null !== $throwable->getPrevious() ? '' : $throwable->getPrevious()->getMessage()]);
         }
         $message = $mapping->isHidden() ? Response::$statusTexts[$mapping->getCode()] : $throwable->getMessage();
         $details = $this->isDebug && !$mapping->isLoggable() ? new ErrorDebugDetails($throwable->getTraceAsString()) : null;

33) /app/src/Listener/ApiExceptionListener.php:53    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
             $this->logger->error($throwable->getMessage(), ['trace' => $throwable->getTraceAsString(), 'previous' => null !== $throwable->getPrevious() ? $throwable->getPrevious()->getMessage() : '']);
         }
         $message = $mapping->isHidden() ? Response::$statusTexts[$mapping->getCode()] : $throwable->getMessage();
-        $details = $this->isDebug && !$mapping->isLoggable() ? new ErrorDebugDetails($throwable->getTraceAsString()) : null;
+        $details = !$this->isDebug && $mapping->isLoggable() ? new ErrorDebugDetails($throwable->getTraceAsString()) : null;
         $data = $this->serializer->serialize(data: new ErrorResponse($message, $details), format: JsonEncoder::FORMAT);
         $exceptionEvent->setResponse(new JsonResponse(data: $data, status: $mapping->getCode(), json: true));
     }

35) /app/src/Mapper/BookMapper.php:28    [M] MBString

--- Original
+++ New
@@ @@
     public static function mapRecommendations(Book $book) : RecommendedBook
     {
         $description = (string) $book->getDescription();
-        $description = mb_strlen($description) > 150 ? mb_substr($description, 0, 150) . '...' : $description;
+        $description = strlen($description) > 150 ? mb_substr($description, 0, 150) . '...' : $description;
         return (new RecommendedBook())->setId($book->getId())->setTitle($book->getTitle())->setSlug($book->getSlug())->setDescription($description);
     }
 }

36) /app/src/Mapper/BookMapper.php:28    [M] GreaterThan

--- Original
+++ New
@@ @@
     public static function mapRecommendations(Book $book) : RecommendedBook
     {
         $description = (string) $book->getDescription();
-        $description = mb_strlen($description) > 150 ? mb_substr($description, 0, 150) . '...' : $description;
+        $description = mb_strlen($description) >= 150 ? mb_substr($description, 0, 150) . '...' : $description;
         return (new RecommendedBook())->setId($book->getId())->setTitle($book->getTitle())->setSlug($book->getSlug())->setDescription($description);
     }
 }

37) /app/src/Mapper/BookMapper.php:28    [M] MBString

--- Original
+++ New
@@ @@
     public static function mapRecommendations(Book $book) : RecommendedBook
     {
         $description = (string) $book->getDescription();
-        $description = mb_strlen($description) > 150 ? mb_substr($description, 0, 150) . '...' : $description;
+        $description = mb_strlen($description) > 150 ? substr($description, 0, 150) . '...' : $description;
         return (new RecommendedBook())->setId($book->getId())->setTitle($book->getTitle())->setSlug($book->getSlug())->setDescription($description);
     }
 }

38) /app/src/Model/BookCategoryListItem.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function __construct(public int $id, public string $title, public string $slug)
     {
     }
-    public function getId() : int
+    protected function getId() : int
     {
         return $this->id;
     }

39) /app/src/Model/BookCategoryListItem.php:19    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->id;
     }
-    public function getTitle() : string
+    protected function getTitle() : string
     {
         return $this->title;
     }

40) /app/src/Model/BookCategoryListItem.php:24    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->title;
     }
-    public function getSlug() : string
+    protected function getSlug() : string
     {
         return $this->slug;
     }
 }

44) /app/src/Model/RecommendedBook.php:12    [M] PublicVisibility

--- Original
+++ New
@@ @@
     private string $title;
     private string $slug;
     private string $description;
-    public function getId() : int
+    protected function getId() : int
     {
         return $this->id;
     }

47) /app/src/Model/RecommendedBook.php:48    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->slug = $slug;
         return $this;
     }
-    public function getDescription() : string
+    protected function getDescription() : string
     {
         return $this->description;
     }

48) /app/src/Repository/BookRepository.php:42    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function findBooksByIds(array $ids) : array
     {
-        return $this->findBy(['id' => $ids]);
+        return $this->findBy([]);
     }
 }

49) /app/src/Repository/ReviewRepository.php:35    [M] CastInt

--- Original
+++ New
@@ @@
      */
     public function getBookTotalRatingSum(int $id) : int
     {
-        return (int) $this->getEntityManager()->createQuery(dql: 'SELECT SUM(r.rating) FROM App\\Entity\\Review r WHERE r.book = :id')->setParameter(key: 'id', value: $id)->getSingleScalarResult();
+        return $this->getEntityManager()->createQuery(dql: 'SELECT SUM(r.rating) FROM App\\Entity\\Review r WHERE r.book = :id')->setParameter(key: 'id', value: $id)->getSingleScalarResult();
     }
     public function getPageByBookId(int $id, int $offset, int $limit) : Countable&Traversable
     {

50) /app/src/Repository/ReviewRepository.php:46    [M] FalseValue

--- Original
+++ New
@@ @@
     public function getPageByBookId(int $id, int $offset, int $limit) : Countable&Traversable
     {
         $query = $this->getEntityManager()->createQuery(dql: 'SELECT r FROM App\\Entity\\Review r WHERE r.book = :id ORDER BY r.createdAt DESC ')->setParameter(key: 'id', value: $id)->setFirstResult($offset)->setMaxResults($limit);
-        return new Paginator(query: $query, fetchJoinCollection: false);
+        return new Paginator(query: $query, fetchJoinCollection: true);
     }
     public function countByBook(int $id) : int
     {

51) /app/src/Repository/ReviewRepository.php:49    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $query = $this->getEntityManager()->createQuery(dql: 'SELECT r FROM App\\Entity\\Review r WHERE r.book = :id ORDER BY r.createdAt DESC ')->setParameter(key: 'id', value: $id)->setFirstResult($offset)->setMaxResults($limit);
         return new Paginator(query: $query, fetchJoinCollection: false);
     }
-    public function countByBook(int $id) : int
+    protected function countByBook(int $id) : int
     {
         return $this->count(['book' => $id]);
     }
 }

53) /app/src/Service/ExceptionHandler/ExceptionMappingResolver.php:25    [M] Coalesce

--- Original
+++ New
@@ @@
             if (empty($mapping['code'])) {
                 throw new InvalidArgumentException(sprintf('Code is mandatory for class %s', $classKey));
             }
-            $this->addMapping(class: $classKey, code: $mapping['code'], hidden: $mapping['hidden'] ?? false, loggable: $mapping['loggable'] ?? false);
+            $this->addMapping(class: $classKey, code: $mapping['code'], hidden: false ?? $mapping['hidden'], loggable: $mapping['loggable'] ?? false);
         }
     }
     public function resolve(string $throwableClass) : ?ExceptionMapping

55) /app/src/Service/Recommendation/RecommendationService.php:40    [M] InstanceOf_

--- Original
+++ New
@@ @@
             return $this->serializer->deserialize(data: $response->getContent(), type: RecommendationResponse::class, format: JsonEncoder::FORMAT);
         } catch (Throwable $exception) {
             $statusCode = $exception->getCode();
-            if ($exception instanceof ClientException && Response::HTTP_FORBIDDEN === $statusCode) {
+            if (true && Response::HTTP_FORBIDDEN === $statusCode) {
                 throw new RecommendationAccessDeniedException();
             }
             throw new RecommendationRequestException($exception->getMessage(), $exception);

56) /app/src/Service/Recommendation/RecommendationService.php:40    [M] LogicalAnd

--- Original
+++ New
@@ @@
             return $this->serializer->deserialize(data: $response->getContent(), type: RecommendationResponse::class, format: JsonEncoder::FORMAT);
         } catch (Throwable $exception) {
             $statusCode = $exception->getCode();
-            if ($exception instanceof ClientException && Response::HTTP_FORBIDDEN === $statusCode) {
+            if ($exception instanceof ClientException || Response::HTTP_FORBIDDEN === $statusCode) {
                 throw new RecommendationAccessDeniedException();
             }
             throw new RecommendationRequestException($exception->getMessage(), $exception);

57) /app/src/Service/ReviewService.php:30    [M] IncrementInteger

--- Original
+++ New
@@ @@
      */
     public function getReviewPageByBookId(int $id, int $page) : ReviewPage
     {
-        $offset = max($page - 1, 0) * self::PAGE_LIMIT;
+        $offset = max($page - 2, 0) * self::PAGE_LIMIT;
         $paginator = $this->reviewRepository->getPageByBookId(id: $id, offset: $offset, limit: self::PAGE_LIMIT);
         $total = count($paginator);
         $items = [];

58) /app/src/Service/ReviewService.php:30    [M] Multiplication

--- Original
+++ New
@@ @@
      */
     public function getReviewPageByBookId(int $id, int $page) : ReviewPage
     {
-        $offset = max($page - 1, 0) * self::PAGE_LIMIT;
+        $offset = max($page - 1, 0) / self::PAGE_LIMIT;
         $paginator = $this->reviewRepository->getPageByBookId(id: $id, offset: $offset, limit: self::PAGE_LIMIT);
         $total = count($paginator);
         $items = [];

59) /app/src/Service/ReviewService.php:44    [M] CastInt

--- Original
+++ New
@@ @@
         foreach ($paginator as $item) {
             $items[] = $this->map($item);
         }
-        return (new ReviewPage())->setRating($this->ratingService->calcReview($id, $total))->setTotal($total)->setPage($page)->setPerPage(self::PAGE_LIMIT)->setPages((int) ceil($total / self::PAGE_LIMIT))->setItems($items);
+        return (new ReviewPage())->setRating($this->ratingService->calcReview($id, $total))->setTotal($total)->setPage($page)->setPerPage(self::PAGE_LIMIT)->setPages(ceil($total / self::PAGE_LIMIT))->setItems($items);
     }
     public function map(Review $review) : ReviewModel
     {

60) /app/src/Service/ReviewService.php:49    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return (new ReviewPage())->setRating($this->ratingService->calcReview($id, $total))->setTotal($total)->setPage($page)->setPerPage(self::PAGE_LIMIT)->setPages((int) ceil($total / self::PAGE_LIMIT))->setItems($items);
     }
-    public function map(Review $review) : ReviewModel
+    protected function map(Review $review) : ReviewModel
     {
         return (new ReviewModel())->setId($review->getId())->setRating($review->getRating())->setCreatedAt($review->getCreatedAt()->format(DATE_ATOM))->setAuthor($review->getAuthor())->setContent($review->getContent());
     }
 }

61) /app/src/Service/RoleService.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = $this->userRepository->getUser($userId);
         $user->setRoles([$role]);
-        $this->entityManager->persist($user);
+        
         $this->entityManager->flush();
     }
 }


Timed Out mutants:
==================

5) /app/src/Controller/AdminController.php:19    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function __construct(private RoleService $roleService)
     {
     }
-    #[OA\Response(response: 200, description: 'Grants ROLE_AUTHOR to a user')]
+    #[OA\Response(response: 199, description: 'Grants ROLE_AUTHOR to a user')]
     #[OA\Response(response: 404, description: 'User not found', attachables: [new Model(type: ErrorResponse::class)])]
     #[Route(path: '/api/v1/admin/grand-author/{userId}', methods: 'POST')]
     public function grantAuthor(int $userId) : Response

6) /app/src/Controller/AdminController.php:19    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function __construct(private RoleService $roleService)
     {
     }
-    #[OA\Response(response: 200, description: 'Grants ROLE_AUTHOR to a user')]
+    #[OA\Response(response: 201, description: 'Grants ROLE_AUTHOR to a user')]
     #[OA\Response(response: 404, description: 'User not found', attachables: [new Model(type: ErrorResponse::class)])]
     #[Route(path: '/api/v1/admin/grand-author/{userId}', methods: 'POST')]
     public function grantAuthor(int $userId) : Response

16) /app/src/Controller/BookCategoryController.php:20    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function __construct(private readonly BookCategoryService $bookCategoryService)
     {
     }
-    #[OA\Response(response: 200, description: 'Return book categories', content: new Model(type: BookCategoryListResponse::class))]
+    #[OA\Response(response: 199, description: 'Return book categories', content: new Model(type: BookCategoryListResponse::class))]
     #[Route(path: '/api/v1/categories', name: 'categories', methods: 'GET|OPTIONS')]
     public function index() : Response
     {

17) /app/src/Controller/BookCategoryController.php:20    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function __construct(private readonly BookCategoryService $bookCategoryService)
     {
     }
-    #[OA\Response(response: 200, description: 'Return book categories', content: new Model(type: BookCategoryListResponse::class))]
+    #[OA\Response(response: 201, description: 'Return book categories', content: new Model(type: BookCategoryListResponse::class))]
     #[Route(path: '/api/v1/categories', name: 'categories', methods: 'GET|OPTIONS')]
     public function index() : Response
     {

18) /app/src/Controller/BookController.php:26    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function __construct(private readonly BookService $bookCategoryService, private readonly ReviewService $reviewService)
     {
     }
-    #[OA\Response(response: 200, description: 'Return book by category id', content: new Model(type: BookListResponse::class))]
+    #[OA\Response(response: 199, description: 'Return book by category id', content: new Model(type: BookListResponse::class))]
     #[OA\Response(response: 404, description: 'Book category not found')]
     #[Route(path: '/api/v1/books/category/{id}', name: 'book_by_category', methods: 'GET|OPTIONS')]
     public function booksByCategory(int $id) : Response

19) /app/src/Controller/BookController.php:26    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function __construct(private readonly BookService $bookCategoryService, private readonly ReviewService $reviewService)
     {
     }
-    #[OA\Response(response: 200, description: 'Return book by category id', content: new Model(type: BookListResponse::class))]
+    #[OA\Response(response: 201, description: 'Return book by category id', content: new Model(type: BookListResponse::class))]
     #[OA\Response(response: 404, description: 'Book category not found')]
     #[Route(path: '/api/v1/books/category/{id}', name: 'book_by_category', methods: 'GET|OPTIONS')]
     public function booksByCategory(int $id) : Response

22) /app/src/Controller/BookController.php:34    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         return $this->json($this->bookCategoryService->findBooksByCategory($id));
     }
-    #[OA\Response(response: 200, description: 'Return book by recommendations id', content: new Model(type: BookListRecommendationResponse::class))]
+    #[OA\Response(response: 199, description: 'Return book by recommendations id', content: new Model(type: BookListRecommendationResponse::class))]
     #[OA\Response(response: 403, description: 'Access Denied')]
     #[Route(path: '/api/v1/books/recommendation/{id}', name: 'book_by_recommendation', methods: 'GET|OPTIONS')]
     public function booksByRecommendations(int $id) : Response

23) /app/src/Controller/BookController.php:34    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         return $this->json($this->bookCategoryService->findBooksByCategory($id));
     }
-    #[OA\Response(response: 200, description: 'Return book by recommendations id', content: new Model(type: BookListRecommendationResponse::class))]
+    #[OA\Response(response: 201, description: 'Return book by recommendations id', content: new Model(type: BookListRecommendationResponse::class))]
     #[OA\Response(response: 403, description: 'Access Denied')]
     #[Route(path: '/api/v1/books/recommendation/{id}', name: 'book_by_recommendation', methods: 'GET|OPTIONS')]
     public function booksByRecommendations(int $id) : Response
