26) /app/src/Controller/BookController.php:42    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         return $this->json($this->bookCategoryService->findBooksByRecommendations($id));
     }
-    #[OA\Response(response: 200, description: 'Return book details information', content: new Model(type: BookDetails::class))]
+    #[OA\Response(response: 199, description: 'Return book details information', content: new Model(type: BookDetails::class))]
     #[OA\Response(response: 404, description: 'Book not found')]
     #[Route(path: '/api/v1/books/{id}', name: 'book_by_id', methods: 'GET|OPTIONS')]
     public function booksById(int $id) : Response

27) /app/src/Controller/BookController.php:42    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         return $this->json($this->bookCategoryService->findBooksByRecommendations($id));
     }
-    #[OA\Response(response: 200, description: 'Return book details information', content: new Model(type: BookDetails::class))]
+    #[OA\Response(response: 201, description: 'Return book details information', content: new Model(type: BookDetails::class))]
     #[OA\Response(response: 404, description: 'Book not found')]
     #[Route(path: '/api/v1/books/{id}', name: 'book_by_id', methods: 'GET|OPTIONS')]
     public function booksById(int $id) : Response

34) /app/src/Controller/SubscriberController.php:21    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function __construct(private readonly SubscriberService $subscriberService)
     {
     }
-    #[OA\Response(response: 200, description: 'Subscribe email to newsletters mailing list')]
+    #[OA\Response(response: 199, description: 'Subscribe email to newsletters mailing list')]
     #[OA\RequestBody(content: new Model(type: SubscriberRequest::class))]
     #[OA\Response(response: 400, description: 'Return 400 error code if email exist', content: new Model(type: ErrorResponse::class))]
     #[OA\Response(response: 422, description: 'Validation errors', content: new Model(type: ErrorResponse::class))]

35) /app/src/Controller/SubscriberController.php:21    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function __construct(private readonly SubscriberService $subscriberService)
     {
     }
-    #[OA\Response(response: 200, description: 'Subscribe email to newsletters mailing list')]
+    #[OA\Response(response: 201, description: 'Subscribe email to newsletters mailing list')]
     #[OA\RequestBody(content: new Model(type: SubscriberRequest::class))]
     #[OA\Response(response: 400, description: 'Return 400 error code if email exist', content: new Model(type: ErrorResponse::class))]
     #[OA\Response(response: 422, description: 'Validation errors', content: new Model(type: ErrorResponse::class))]

40) /app/src/DataFixtures/BookCategoryFixture.php:16    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public const DEVICES_CATEGORY = 'devices';
     public function load(ObjectManager $manager) : void
     {
-        $categorise = [static::DEVICES_CATEGORY => (new BookCategory())->setTitle('Devices')->setSlug('devices'), static::ANDROID_CATEGORY => (new BookCategory())->setTitle('Android')->setSlug('android')];
+        $categorise = [static::ANDROID_CATEGORY => (new BookCategory())->setTitle('Android')->setSlug('android')];
         foreach ($categorise as $category) {
             $manager->persist($category);
         }

41) /app/src/DataFixtures/BookCategoryFixture.php:17    [M] ArrayItem

--- Original
+++ New
@@ @@
     public const DEVICES_CATEGORY = 'devices';
     public function load(ObjectManager $manager) : void
     {
-        $categorise = [static::DEVICES_CATEGORY => (new BookCategory())->setTitle('Devices')->setSlug('devices'), static::ANDROID_CATEGORY => (new BookCategory())->setTitle('Android')->setSlug('android')];
+        $categorise = [static::DEVICES_CATEGORY > (new BookCategory())->setTitle('Devices')->setSlug('devices'), static::ANDROID_CATEGORY => (new BookCategory())->setTitle('Android')->setSlug('android')];
         foreach ($categorise as $category) {
             $manager->persist($category);
         }

42) /app/src/DataFixtures/BookCategoryFixture.php:18    [M] ArrayItem

--- Original
+++ New
@@ @@
     public const DEVICES_CATEGORY = 'devices';
     public function load(ObjectManager $manager) : void
     {
-        $categorise = [static::DEVICES_CATEGORY => (new BookCategory())->setTitle('Devices')->setSlug('devices'), static::ANDROID_CATEGORY => (new BookCategory())->setTitle('Android')->setSlug('android')];
+        $categorise = [static::DEVICES_CATEGORY => (new BookCategory())->setTitle('Devices')->setSlug('devices'), static::ANDROID_CATEGORY > (new BookCategory())->setTitle('Android')->setSlug('android')];
         foreach ($categorise as $category) {
             $manager->persist($category);
         }

43) /app/src/DataFixtures/BookCategoryFixture.php:21    [M] Foreach_

--- Original
+++ New
@@ @@
     public function load(ObjectManager $manager) : void
     {
         $categorise = [static::DEVICES_CATEGORY => (new BookCategory())->setTitle('Devices')->setSlug('devices'), static::ANDROID_CATEGORY => (new BookCategory())->setTitle('Android')->setSlug('android')];
-        foreach ($categorise as $category) {
+        foreach (array() as $category) {
             $manager->persist($category);
         }
         $manager->persist((new BookCategory())->setTitle('Data')->setSlug('data'));

45) /app/src/DataFixtures/BookCategoryFixture.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         foreach ($categorise as $category) {
             $manager->persist($category);
         }
-        $manager->persist((new BookCategory())->setTitle('Data')->setSlug('data'));
+        
         $manager->persist((new BookCategory())->setTitle('IOS')->setSlug('ios'));
         $manager->flush();
         foreach ($categorise as $key => $category) {

47) /app/src/DataFixtures/BookCategoryFixture.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         $manager->persist((new BookCategory())->setTitle('Data')->setSlug('data'));
         $manager->persist((new BookCategory())->setTitle('IOS')->setSlug('ios'));
-        $manager->flush();
+        
         foreach ($categorise as $key => $category) {
             $this->addReference($key, $category);
         }
     }
 }

48) /app/src/DataFixtures/BookCategoryFixture.php:30    [M] Foreach_

--- Original
+++ New
@@ @@
         $manager->persist((new BookCategory())->setTitle('Data')->setSlug('data'));
         $manager->persist((new BookCategory())->setTitle('IOS')->setSlug('ios'));
         $manager->flush();
-        foreach ($categorise as $key => $category) {
+        foreach (array() as $key => $category) {
             $this->addReference($key, $category);
         }
     }
 }

53) /app/src/DataFixtures/BookFixture.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $androidCategory = $this->getReference(name: BookCategoryFixture::ANDROID_CATEGORY);
         $devicesCategory = $this->getReference(name: BookCategoryFixture::DEVICES_CATEGORY);
-        $manager->persist((new Book())->setTitle('Lorem Ipsum')->setPublicationDate(new DateTimeImmutable(datetime: '2019-06-08'))->setSlug('lorem')->setAuthors(['Bots', 'ChatBot'])->setImage('/public/default1.png')->setCategories(new ArrayCollection([$androidCategory, $devicesCategory])));
+        
         $manager->flush();
     }
     public function getDependencies() : array

54) /app/src/DataFixtures/BookFixture.php:36    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $androidCategory = $this->getReference(name: BookCategoryFixture::ANDROID_CATEGORY);
         $devicesCategory = $this->getReference(name: BookCategoryFixture::DEVICES_CATEGORY);
-        $manager->persist((new Book())->setTitle('Lorem Ipsum')->setPublicationDate(new DateTimeImmutable(datetime: '2019-06-08'))->setSlug('lorem')->setAuthors(['Bots', 'ChatBot'])->setImage('/public/default1.png')->setCategories(new ArrayCollection([$androidCategory, $devicesCategory])));
+        $manager->persist((new Book())->setTitle('Lorem Ipsum')->setPublicationDate(new DateTimeImmutable(datetime: '2019-06-08'))->setSlug('lorem')->setAuthors(['ChatBot'])->setImage('/public/default1.png')->setCategories(new ArrayCollection([$androidCategory, $devicesCategory])));
         $manager->flush();
     }
     public function getDependencies() : array

55) /app/src/DataFixtures/BookFixture.php:38    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $androidCategory = $this->getReference(name: BookCategoryFixture::ANDROID_CATEGORY);
         $devicesCategory = $this->getReference(name: BookCategoryFixture::DEVICES_CATEGORY);
-        $manager->persist((new Book())->setTitle('Lorem Ipsum')->setPublicationDate(new DateTimeImmutable(datetime: '2019-06-08'))->setSlug('lorem')->setAuthors(['Bots', 'ChatBot'])->setImage('/public/default1.png')->setCategories(new ArrayCollection([$androidCategory, $devicesCategory])));
+        $manager->persist((new Book())->setTitle('Lorem Ipsum')->setPublicationDate(new DateTimeImmutable(datetime: '2019-06-08'))->setSlug('lorem')->setAuthors(['Bots', 'ChatBot'])->setImage('/public/default1.png')->setCategories(new ArrayCollection([$devicesCategory])));
         $manager->flush();
     }
     public function getDependencies() : array

56) /app/src/DataFixtures/BookFixture.php:41    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $devicesCategory = $this->getReference(name: BookCategoryFixture::DEVICES_CATEGORY);
         $manager->persist((new Book())->setTitle('Lorem Ipsum')->setPublicationDate(new DateTimeImmutable(datetime: '2019-06-08'))->setSlug('lorem')->setAuthors(['Bots', 'ChatBot'])->setImage('/public/default1.png')->setCategories(new ArrayCollection([$androidCategory, $devicesCategory])));
-        $manager->flush();
+        
     }
     public function getDependencies() : array
     {

57) /app/src/DataFixtures/BookFixture.php:46    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getDependencies() : array
     {
-        return [BookCategoryFixture::class];
+        return [];
     }
 }

58) /app/src/Entity/Book.php:156    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->categories = $categories;
         return $this;
     }
-    public function getIsbn() : ?string
+    protected function getIsbn() : ?string
     {
         return $this->isbn;
     }

59) /app/src/Entity/Book.php:192    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->formats = $formats;
         return $this;
     }
-    public function getReviews() : Collection
+    protected function getReviews() : Collection
     {
         return $this->reviews;
     }

60) /app/src/Entity/Book.php:197    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->reviews;
     }
-    public function setReviews(Collection $reviews) : static
+    protected function setReviews(Collection $reviews) : static
     {
         $this->reviews = $reviews;
         return $this;
     }
 }

61) /app/src/Entity/BookRelationToBookFormat.php:31    [M] PublicVisibility

--- Original
+++ New
@@ @@
     #[ORM\ManyToOne(targetEntity: BookFormat::class, fetch: 'EAGER')]
     #[ORM\JoinColumn(nullable: false)]
     private BookFormat $format;
-    public function getId() : ?int
+    protected function getId() : ?int
     {
         return $this->id;
     }

62) /app/src/Entity/BookRelationToBookFormat.php:60    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->discountPercent = $discountPercent;
         return $this;
     }
-    public function getBook() : Book
+    protected function getBook() : Book
     {
         return $this->book;
     }

63) /app/src/Entity/BookRelationToBookFormat.php:65    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->book;
     }
-    public function setBook(Book $book) : static
+    protected function setBook(Book $book) : static
     {
         $this->book = $book;
         return $this;

71) /app/src/Entity/Subscriber.php:62    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->createdAt;
     }
-    public function setCreatedAt(DateTimeInterface $createdAt) : static
+    protected function setCreatedAt(DateTimeInterface $createdAt) : static
     {
         $this->createdAt = $createdAt;
         return $this;
     }
 }

72) /app/src/Entity/User.php:39    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->id;
     }
-    public function getEmail() : ?string
+    protected function getEmail() : ?string
     {
         return $this->email;
     }

73) /app/src/Entity/User.php:51    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->email = $email;
         return $this;
     }
-    public function getFirstName() : ?string
+    protected function getFirstName() : ?string
     {
         return $this->firstName;
     }

74) /app/src/Entity/User.php:63    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->firstName = $firstName;
         return $this;
     }
-    public function getLastname() : ?string
+    protected function getLastname() : ?string
     {
         return $this->lastname;
     }

79) /app/src/Model/BookDetails.php:29    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->id;
     }
-    public function setId(int $id) : static
+    protected function setId(int $id) : static
     {
         $this->id = $id;
         return $this;

80) /app/src/Model/BookDetails.php:41    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->title;
     }
-    public function setTitle(string $title) : static
+    protected function setTitle(string $title) : static
     {
         $this->title = $title;
         return $this;

81) /app/src/Model/BookDetails.php:53    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->slug;
     }
-    public function setSlug(string $slug) : static
+    protected function setSlug(string $slug) : static
     {
         $this->slug = $slug;
         return $this;

82) /app/src/Model/BookDetails.php:65    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->image;
     }
-    public function setImage(string $image) : static
+    protected function setImage(string $image) : static
     {
         $this->image = $image;
         return $this;

84) /app/src/Model/BookDetails.php:95    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->publicationDate;
     }
-    public function setPublicationDate(string $publicationDate) : static
+    protected function setPublicationDate(string $publicationDate) : static
     {
         $this->publicationDate = $publicationDate;
         return $this;

85) /app/src/Model/BookFormatListItem.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
     private ?string $comment;
     private float $price;
     private ?int $discountPercent;
-    public function getId() : int
+    protected function getId() : int
     {
         return $this->id;
     }

87) /app/src/Model/BookFormatListItem.php:38    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->title = $title;
         return $this;
     }
-    public function getDescription() : ?string
+    protected function getDescription() : ?string
     {
         return $this->description;
     }

88) /app/src/Model/BookFormatListItem.php:50    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->description = $description;
         return $this;
     }
-    public function getComment() : ?string
+    protected function getComment() : ?string
     {
         return $this->comment;
     }

89) /app/src/Model/BookFormatListItem.php:62    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->comment = $comment;
         return $this;
     }
-    public function getPrice() : float
+    protected function getPrice() : float
     {
         return $this->price;
     }

90) /app/src/Model/BookFormatListItem.php:74    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->price = $price;
         return $this;
     }
-    public function getDiscountPercent() : ?int
+    protected function getDiscountPercent() : ?int
     {
         return $this->discountPercent;
     }

97) /app/src/Model/ErrorDebugDetails.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function __construct(private string $trace)
     {
     }
-    public function getTrace() : string
+    protected function getTrace() : string
     {
         return $this->trace;
     }
 }

100) /app/src/Model/Recommendation/RecommendationResponse.php:20    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->id;
     }
-    public function getTs() : int
+    protected function getTs() : int
     {
         return $this->ts;
     }

101) /app/src/Model/SignUpRequest.php:76    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->password = $password;
         return $this;
     }
-    public function getConfirmPassword() : string
+    protected function getConfirmPassword() : string
     {
         return $this->confirmPassword;
     }

102) /app/src/Model/SubscriberRequest.php:25    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->email;
     }
-    public function isAgreed() : bool
+    protected function isAgreed() : bool
     {
         return $this->agreed;
     }
 }

114) /app/src/Service/BookService.php:94    [M] NewObject

--- Original
+++ New
@@ @@
         });
         $categories = $book->getCategories()->map(func: function (BookCategory $bookCategory) {
-            return new BookCategoryListItem(id: $bookCategory->getId(), title: $bookCategory->getTitle(), slug: $bookCategory->getSlug());
+            new BookCategoryListItem(id: $bookCategory->getId(), title: $bookCategory->getTitle(), slug: $bookCategory->getSlug());
+            return null;
         });
         return BookMapper::map($book, BookDetails::class)->setReview($reviews)->setCategories($categories->toArray())->setFormats($formats->toArray())->setRating($this->ratingService->calcReview($id, $reviews));
     }
 }
